[
    {
        "index":0,
        "propertyCode":"106771522",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/aa\/8d\/fa\/1293504017.webp",
        "externalReference":"MC.E.D-LD",
        "numPhotos":46,
        "floor":"en",
        "price":1600.0,
        "priceInfo":{
            "price":{
                "amount":1600.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1400,
                    "priceDropPercentage":47
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":45.0,
        "exterior":true,
        "rooms":1,
        "bathrooms":1,
        "address":"calle de Marià Cubí, 175",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sarrià-Sant Gervasi",
        "country":"es",
        "neighborhood":"Sant Gervasi - Galvany",
        "latitude":41.3954047,
        "longitude":2.1451492,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/106771522\/",
        "distance":"2620",
        "description":"Bienvenido a este encantador loft industrial dúplex, ubicado en la planta baja en una calle tranquila cerca de la clínica Barraquer. Con una superficie de aproximadamente 45 m², este apartamento de diseño moderno y minimalista está pensado para ofrecer una comodidad óptima durante tu estancia. Las grandes ventanas permiten que entre luz natural, creando un espacio luminoso y agradable, sin perder la atmósfera acogedora. La ubicación del apartamento, cerca de la Avenida Diagonal, permite un fácil acceso al transporte público (metro, autobuses), lo que es ideal para explorar toda la ciudad. Es importante destacar que el apartamento está situado entre la planta baja y el primer piso, con escaleras para acceder, ya que el edificio no dispone de ascensor. Este loft puede alojar hasta tres personas. Cuenta con una habitación en el primer piso con una cama doble cómoda y acceso directo al baño, que está equipado con ducha, inodoro y lavabo. Esta habitación es ideal para una estancia tranquila. Bajando las escaleras, encontrarás una sala de estar amplia y acogedora, con un cómodo sofá y televisión para relajarte después de un día ajetreado. La cocina está completamente equipada con todo lo necesario para preparar tus comidas: nevera, placa de cocina, microondas, lavavajillas, hervidor, cafetera y utensilios de cocina. Podrás cocinar fácilmente y disfrutar de tus comidas en la comodidad del apartamento. El apartamento también cuenta con muchas comodidades para una estancia agradable, como plancha, secador de pelo, aire acondicionado, calefacción, lavadora y secadora. También se incluye una conexión Wi-Fi gratuita, para que puedas mantenerte conectado durante tu estancia. El barrio tranquilo alrededor de la clínica Barraquer ofrece un entorno agradable y está cerca de muchas atracciones de la ciudad. Encontrarás tiendas, restaurantes y lugares de entretenimiento cercanos para disfrutar de tu experiencia en Barcelona. ¡Estaremos encantados de recibirte en este cómodo loft y contribuir a que tu estancia en Barcelona sea inolvidable!",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":36.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Gervasi - Galvany, Barcelona",
            "title":"Piso en calle de Marià Cubí, 175"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":1,
        "propertyCode":"106773688",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/64\/8c\/a9\/1293569017.webp",
        "externalReference":"RF.loft.1.2-LD",
        "numPhotos":35,
        "floor":"1",
        "price":1750.0,
        "priceInfo":{
            "price":{
                "amount":1750.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1250,
                    "priceDropPercentage":42
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":40.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle de Roger de Flor",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"El Fort Pienc",
        "latitude":41.3911501,
        "longitude":2.1801966,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106773688\/",
        "distance":"879",
        "description":"Bienvenido a este moderno loft bien situado en Barcelona, a pocos pasos del Arco de Triunfo, con una terraza en la azotea, una piscina comunitaria y un solárium. Con una superficie de 40 m², este apartamento puede alojar hasta 4 personas en un ambiente cómodo y práctico. El loft consta de una amplia sala de estar-comedor, con acceso directo a una galería interior, donde podrás relajarte después de un día de visitas. La cocina abierta está totalmente equipada para satisfacer tus necesidades, con electrodomésticos modernos como nevera, horno, microondas, lavadora y lavavajillas, lo que te permite preparar tus comidas con facilidad. El apartamento dispone de 1 cama doble y 2 camas individuales, ideal para grupos o familias. El baño está equipado con una amplia ducha, brindando comodidad y privacidad a todos los huéspedes. Este loft está ubicado en la planta baja, ofreciendo gran accesibilidad. Su ubicación, a solo unos metros del Arco de Triunfo, te permite disfrutar de la cercanía de los transportes públicos. Encontrarás una estación de metro justo al lado, así como paradas de autobús, lo que facilita el acceso al aeropuerto y a las principales atracciones turísticas de la ciudad. La ubicación es perfecta para explorar Barcelona: a solo 10 minutos a pie del Museo Picasso y a 15 minutos del Palau de la Música Catalana. También estarás cerca de lugares emblemáticos como la Casa Batlló, la Sagrada Familia, La Pedrera, el barrio Gótico y la Plaça Catalunya. Finalmente, la terraza en la azotea con piscina y solárium es un espacio ideal para disfrutar del sol, relajarte y tomar algo mientras contemplas las vistas de la ciudad. ¡Esperamos con ansias su visita a Barcelona! Les ofrecemos una experiencia inolvidable en esta maravillosa ciudad.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":44.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Fort Pienc, Barcelona",
            "title":"Piso en calle de Roger de Flor"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":2,
        "propertyCode":"106778054",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/c0\/5a\/90\/1293692955.webp",
        "externalReference":" RF.loft.2.2-LD",
        "numPhotos":47,
        "floor":"bj",
        "price":1750.0,
        "priceInfo":{
            "price":{
                "amount":1750.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1250,
                    "priceDropPercentage":42
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":40.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle de Roger de Flor",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"El Fort Pienc",
        "latitude":41.3911627,
        "longitude":2.1810989,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106778054\/",
        "distance":"931",
        "description":"¡Bienvenidos a nuestro loft en el centro de Barcelona, junto al Arco de Triunfo, con terraza, piscina comunitaria y solárium! Este loft de 40 m² está ubicado en una de las zonas más céntricas de la ciudad, a pocos pasos de las principales atracciones turísticas. El loft tiene capacidad para hasta 4 personas e incluye una amplia sala de estar con comedor, que ofrece acceso directo a una galería interior. La cocina abierta está completamente equipada con un frigorífico, horno, microondas, lavadora, lavavajillas, lo que te permitirá preparar tus comidas con facilidad. Además, dispone de 1 cama doble y 2 camas individuales, así como un baño completo con ducha. Además de su moderno interior, este loft cuenta con una terraza en la azotea, donde podrás disfrutar de una piscina comunitaria, solárium y una vista impresionante de la ciudad. Es el lugar perfecto para relajarse después de un día de exploración. La ubicación de este apartamento es una gran ventaja: situado en la planta baja del edificio, a solo unos metros del Arco de Triunfo, está muy bien comunicado con el transporte público. Encontrarás paradas de autobús cercanas, así como una estación de metro a solo unos pasos. La estación de tren, también cercana, facilita el acceso al aeropuerto y a otras partes de la ciudad. Este emplazamiento es ideal para descubrir los tesoros de Barcelona, con lugares imprescindibles como Montjuic, Plaza España, los principales museos, los teatros de la Avenida Paral·lel y el Camp Nou a la vuelta de la esquina. A solo 10 minutos a pie, podrás visitar el Museo Picasso, y a 15 minutos, el Palau de la Música Catalana. También estarás cerca de la Casa Batlló, la Sagrada Familia, La Pedrera, el Barrio Gótico, Plaça Catalunya y muchas otras atracciones emblemáticas. ¡Nos encantaría darte la bienvenida y ofrecerte una experiencia inolvidable en esta maravillosa ciudad que es Barcelona!",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":44.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Fort Pienc, Barcelona",
            "title":"Piso en calle de Roger de Flor"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":3,
        "propertyCode":"106773454",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/7c\/e7\/af\/1293562522.webp",
        "externalReference":" RF.loft.1.1-LD",
        "numPhotos":37,
        "floor":"1",
        "price":1900.0,
        "priceInfo":{
            "price":{
                "amount":1900.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1100,
                    "priceDropPercentage":37
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":60.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle de Roger de Flor",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"El Fort Pienc",
        "latitude":41.395077,
        "longitude":2.1806056,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106773454\/",
        "distance":"1261",
        "description":"¡Bienvenido a este magnífico loft cerca del Arco de Triunfo en Barcelona, con terraza, piscina-solarium y Wi-Fi gratuito! Este apartamento de 60 m² es perfecto para alojar hasta 6 personas, con un diseño moderno y espacios abiertos que te harán sentir como en casa. El loft está ubicado en la zona más céntrica de Barcelona, a pocos pasos de las principales atracciones turísticas y del transporte público. El apartamento dispone de una amplia sala de estar y comedor, creando un espacio cómodo para relajarse. La cocina abierta está completamente equipada con todo lo necesario para preparar tus comidas: nevera, horno, microondas, lavavajillas y lavadora. El loft cuenta con 2 camas dobles y 2 camas individuales, ideales para familias o grupos de amigos. El baño está equipado con una ducha moderna. Una de las grandes atracciones de este apartamento es su terraza privada con piscina-solarium, perfecta para disfrutar del sol, relajarse o pasar momentos agradables al aire libre. La conexión Wi-Fi gratuita está disponible en todo el apartamento, incluida la zona de la piscina, para que puedas estar conectado en todo momento. La ubicación de este apartamento es excepcional. Está a pocos metros del Arco de Triunfo, ofreciendo unas vistas impresionantes y un acceso fácil al transporte público. El metro y las paradas de autobús están muy cerca, facilitando tus desplazamientos por Barcelona. También estás a solo unos minutos de la estación de tren, que te lleva al aeropuerto y a otras partes de la ciudad. Este loft es un excelente punto de partida para descubrir Barcelona. A solo 10 minutos a pie, encontrarás el Museo Picasso, a 15 minutos el Palau de la Música Catalana, así como lugares emblemáticos como la Casa Batlló, la Sagrada Familia, La Pedrera, el barrio gótico, la Plaça Catalunya, y mucho más. La ubicación es ideal para explorar la ciudad mientras disfrutas de la comodidad de un apartamento moderno y bien situado.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":32.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Fort Pienc, Barcelona",
            "title":"Piso en calle de Roger de Flor"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":4,
        "propertyCode":"106777751",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/6a\/e9\/8d\/1293688187.webp",
        "externalReference":"RF.loft.2.1-LD",
        "numPhotos":41,
        "floor":"bj",
        "price":1900.0,
        "priceInfo":{
            "price":{
                "amount":1900.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1100,
                    "priceDropPercentage":37
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":60.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle de Roger de Flor",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"El Fort Pienc",
        "latitude":41.3937819,
        "longitude":2.1823811,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106777751\/",
        "distance":"1221",
        "description":"¡Bienvenidos a nuestro loft en el Arc de Triomphe, en el centro de Barcelona, con terraza, piscina y Wi-Fi gratuito! Este loft de 60 m² puede alojar hasta 6 personas, ofreciendo un entorno ideal para su estancia en la ciudad. El salón-comedor, luminoso y espacioso, es el centro del apartamento, con acceso a una galería interior. La cocina abierta está completamente equipada con nevera, horno, microondas, lavadora y lavavajillas, para ofrecerle toda la comodidad necesaria. El loft dispone de dos camas dobles y dos camas individuales, además de un baño completo con ducha. Además de estas comodidades, podrá disfrutar de una terraza común con piscina y solárium, perfectos para momentos de relajación en total tranquilidad. El apartamento está ubicado en la planta baja del edificio, a solo unos metros del Arc de Triomphe, en una zona central muy bien comunicada por transporte público. Encontrará paradas de autobús y una estación de metro cercanas, así como una estación de tren que le permitirá acceder fácilmente al aeropuerto y a otros puntos de la ciudad. Su ubicación estratégica es ideal para descubrir las principales atracciones de Barcelona, como Montjuic, la Plaza España, el Camp Nou y los museos de la ciudad. A solo 10 minutos a pie, podrá visitar el Museo Picasso, y en 15 minutos, el Palau de la Música Catalana. También estará cerca de lugares emblemáticos como la Sagrada Familia, la Casa Batlló, La Pedrera, el Barrio Gótico y la Plaça Catalunya. Estaremos encantados de darle la bienvenida y ofrecerle una experiencia inolvidable en Barcelona, una ciudad llena de encanto y descubrimientos.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":32.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Fort Pienc, Barcelona",
            "title":"Piso en calle de Roger de Flor"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":5,
        "propertyCode":"106770938",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/cf\/5f\/04\/1293482678.webp",
        "externalReference":"MC.B.A-LD",
        "numPhotos":28,
        "floor":"bj",
        "price":2000.0,
        "priceInfo":{
            "price":{
                "amount":2000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":1000,
                    "priceDropPercentage":33
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":55.0,
        "exterior":true,
        "rooms":1,
        "bathrooms":1,
        "address":"calle de Marià Cubí",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sarrià-Sant Gervasi",
        "country":"es",
        "neighborhood":"Sant Gervasi - Galvany",
        "latitude":41.395346,
        "longitude":2.144055,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106770938\/",
        "distance":"2699",
        "description":"¡Bienvenido a este apartamento con terraza\/jardín común en Sant Gervasi, un barrio tranquilo y bien situado en Barcelona! Con una superficie de aproximadamente 55 m², el apartamento se encuentra en un edificio con ascensor, lo que ofrece fácil acceso y comodidad. Gracias a sus grandes ventanales, el apartamento disfruta de una abundante luz natural, creando un ambiente luminoso y aireado. Su excelente ubicación cerca de la Avenida Diagonal garantiza conexiones rápidas y fáciles con el transporte público, lo que facilita explorar Barcelona. Este apartamento puede alojar hasta 3 personas. Cuenta con una habitación con una cómoda cama doble y una sala de estar con un sofá que puede utilizarse para descansar o dormir. El baño está equipado con una ducha, un inodoro moderno y un lavabo, ofreciendo todo lo necesario para su comodidad. La sala de estar está equipada con una televisión para relajarse después de un día de descubrimientos. La cocina está completamente equipada con un lavavajillas, microondas, cafetera, cocina eléctrica, hervidor de agua, horno, frigorífico, congelador y una placa vitrocerámica, lo que le permite cocinar sus platos favoritos con facilidad. El apartamento también está equipado con muchas comodidades prácticas para hacer su estancia agradable, como una plancha, un secador de pelo, aire acondicionado y calefacción para su comodidad durante todo el año. También encontrará una lavadora y una secadora para su conveniencia. Se ofrece acceso gratuito a Wi-Fi en todo el apartamento, lo que le permite mantenerse conectado y planificar sus visitas por la ciudad. El barrio de Sant Gervasi es principalmente residencial y tranquilo, pero está perfectamente conectado con el resto de la ciudad gracias a las estaciones de metro y autobús cercanas. Además, está a pocos pasos de los barrios dinámicos de Gracia y Eixample, conocidos por sus pintorescas calles, boutiques de moda, cafeterías, bares y restaurantes. Así, podrá disfrutar de la mejor experiencia de Barcelona, combinando tranquilidad y fácil acceso a las atracciones más populares.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":36.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Gervasi - Galvany, Barcelona",
            "title":"Piso en calle de Marià Cubí"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":6,
        "propertyCode":"105531039",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/c3\/2d\/7a\/1297831904.webp",
        "externalReference":"JK-A2",
        "numPhotos":15,
        "floor":"2",
        "price":1500.0,
        "priceInfo":{
            "price":{
                "amount":1500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2250.0,
                    "priceDropValue":750,
                    "priceDropPercentage":33
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":60.0,
        "exterior":true,
        "rooms":1,
        "bathrooms":1,
        "address":"calle Comtal",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"El Gòtic",
        "latitude":41.3845267,
        "longitude":2.1730493,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/105531039\/",
        "distance":"70",
        "description":"**Alquiler Temporal** 1500-€ mes. Piso reformado, totalmente equipado para entrar a vivir, todo exterior, 3 balcones, espacioso, este piso es ideal para parejas o persona sola que desee una vivienda reformada. Finca con ascensor. Ubicado en la prestigiosa zona de metro Urquinaona, este apartamento ofrece un entorno sofisticado en el corazón de Barcelona. - Características del Piso. - Superficie: 52 m². - Distribución: 1 habitación de matrimonio, . Todas las habitaciones tienen armarios y la habituación pequeña puede ser utilizada como despacho, vestidor o dormitorio de visitas. - Baño completo. - 3 Balcones: Con vistas a calle y mucho encanto. - Orientación: Este, luminoso y sol durante la mañana. **Detalles Adicionales: ** - Acabados de Calidad: Carpintería interior de aluminio y acogedor suelo de mosaico hidraúlico. - Comodidades: Aire acondicionado y calefacción por gas. - Condiciones: El piso se alquila amueblado y equipado, cocina horno, lavavajillas, lavadora, aire acondicionado, vitrocerámica. **Ubicación Inmejorable: ** - Céntrico y bien comunicado: A 2 minutos del metro Urquinaona - Transporte: Diversas paradas de autobús, metro. - Servicios cercanos: Supermercados, colegios, universidades, hospitales y centros médicos. - Entorno: ** Zonas verdes, parques y áreas infantiles. Este piso representa una oportunidad única para disfrutar de un estilo de vida urbano y sofisticado en una de las zonas más privilegiadas de Barcelona. **Alquiler Temporal** 1500-€ MES Dos meses de fianza. Honorarios a cargo inquilino. Contactar al numero.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":25.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Gòtic, Barcelona",
            "title":"Piso en calle Comtal"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":7,
        "propertyCode":"101333184",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/cb\/6d\/3e\/1118573091.webp",
        "externalReference":"5035",
        "numPhotos":37,
        "floor":"8",
        "price":2500.0,
        "priceInfo":{
            "price":{
                "amount":2500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3700.0,
                    "priceDropValue":1200,
                    "priceDropPercentage":32
                }
            }
        },
        "propertyType":"penthouse",
        "operation":"rent",
        "size":110.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"diputacion, 279",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Dreta de l'Eixample",
        "latitude":41.391524,
        "longitude":2.1680884,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/101333184\/",
        "distance":"840",
        "description":"SOBRE ATICO. \/. PASEO SANT JOAN Calle Diputación, una ubicación privilegiada en pleno corazón de Barcelona. A tan solo 5 minutos a pie de Paseo de Gracia y perfectamente conectada con las estaciones de metro Girona y Tetuan. Rodeada de una amplia oferta de restaurantes, tiendas y servicios, en una zona que combina la tranquilidad de un barrio residencial con la comodidad de estar cerca de todo lo que necesitas. Una oportunidad única para vivir en una de las áreas más emblemáticas de la ciudad. DISTRIBUCION; amplio salón con salida a una terraza, de 20 metros, vistas despejadas, 2 dormitorios, baño, cocina abierta totalmente equipada, excelente zona y distribución, contrato temporal.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":23.0,
        "detailedType":{
            "typology":"flat",
            "subTypology":"penthouse"
        },
        "suggestedTexts":{
            "subtitle":"La Dreta de l'Eixample, Barcelona",
            "title":"Ático en diputacion, 279"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":8,
        "propertyCode":"106516854",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/8a\/e3\/0a\/1285211763.webp",
        "externalReference":"18337",
        "numPhotos":23,
        "floor":null,
        "price":2800.0,
        "priceInfo":{
            "price":{
                "amount":2800.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4000.0,
                    "priceDropValue":1200,
                    "priceDropPercentage":30
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":105.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"Barrio El Gòtic",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"El Gòtic",
        "latitude":41.3784117,
        "longitude":2.1762056,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106516854\/",
        "distance":"779",
        "description":"Piso en alquiler temporal de 105 m² con dos dormitorios y balcones con vistas a la ciudad, situado en el emblemático Barri Gòtic, a escasos pasos del Port Vell y junto al Passeig de Colom. La vivienda dispone de un amplio salón-comedor que se abre a dos balcones con vistas a la ciudad. La cocina americana está equipada con horno, frigorífico, lavavajillas, microondas y lavadora. La zona de descanso se compone de dos dormitorios dobles, uno exterior y otro interior con acceso a un patio privado. Además, el inmueble cuenta con un baño completo con ducha y un aseo. Entre sus acabados destacan los suelos de parquet y las ventanas de doble acristalamiento. Ubicado en el corazón del Barrio Gótico, en el distrito de Ciutat Vella, una zona célebre por su encanto histórico, calles adoquinadas y edificios antiguos que evocan la Barcelona medieval. La zona ofrece una vibrante vida urbana con una amplia variedad de tiendas, bares, restaurantes y cafeterías tradicionales. Además, se encuentra cerca de monumentos icónicos como la Catedral de Barcelona y la Plaça Reial, proporcionando una experiencia de vida única que fusiona historia, cultura y modernidad en pleno centro de la ciudad. ZONA: Ciutat Vella - Barrio Gótico. TRANSPORTE PÚBLICO: Metro (L3 - Liceu y L4 - Jaume I), Renfe (Estación de Plaça de Catalunya), Bus y Bicing. Índice de precios estatal: no aplica. *.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":27.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Gòtic, Barcelona",
            "title":"Piso"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":9,
        "propertyCode":"104568270",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/50\/6a\/2a\/1224666990.webp",
        "externalReference":"ATBCN032",
        "numPhotos":36,
        "floor":"6",
        "price":4000.0,
        "priceInfo":{
            "price":{
                "amount":4000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":5500.0,
                    "priceDropValue":1500,
                    "priceDropPercentage":27
                }
            }
        },
        "propertyType":"penthouse",
        "operation":"rent",
        "size":80.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"calle de Balmes",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Dreta de l'Eixample",
        "latitude":41.3910872,
        "longitude":2.1622817,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/104568270\/",
        "distance":"1141",
        "description":"Espectacular atico de lujo temporal amueblado en el eixample, reformado hace un año por completo con excelentes calidades. Cuenta con 80 metros cuadrados en el interior y 80 metros cuadrados en el exterior repartido en una terraza con dos alturas. En el piso encontramos un agradable recibidor junto al salón integrado con la cocina abierta y totalmente equipada con todos los electrodomésticos. Junto al salón tenemos la salida a una magnifica terraza orientada a sur y totalmente equipada para disfrutar al máximo de la misma. Una de las habitaciones en suite totalmente exterior con salida a la terraza, el baño cuenta con placa de ducha. La segunda habitación en suite, con vestidor, el baño con placa de ducha. Cuenta con aire acondicionado y calefacción. Se incluye limpieza e internet en el precio. La finca cuenta con ascensor y conserje.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":50.0,
        "detailedType":{
            "typology":"flat",
            "subTypology":"penthouse"
        },
        "suggestedTexts":{
            "subtitle":"La Dreta de l'Eixample, Barcelona",
            "title":"Ático en calle de Balmes"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":10,
        "propertyCode":"106771230",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/2e\/17\/5b\/1293493475.webp",
        "externalReference":"MC.B.B-LD",
        "numPhotos":38,
        "floor":"bj",
        "price":2200.0,
        "priceInfo":{
            "price":{
                "amount":2200.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":800,
                    "priceDropPercentage":27
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":65.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle de Marià Cubí, 175",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sarrià-Sant Gervasi",
        "country":"es",
        "neighborhood":"Sant Gervasi - Galvany",
        "latitude":41.3954047,
        "longitude":2.1451492,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/106771230\/",
        "distance":"2620",
        "description":"¡Bienvenidos a este moderno apartamento en Sant Gervasi con una terraza y un jardín! Con una superficie de 65 m², este loft industrial está ubicado en un edificio con ascensor. Sus grandes ventanas permiten que la luz natural inunde el espacio, creando un ambiente luminoso y aireado. La ubicación privilegiada, cerca de la Avenida Diagonal, garantiza una excelente conexión con el transporte público, facilitando así tus desplazamientos por Barcelona. El apartamento puede alojar hasta 5 personas y consta de 2 habitaciones: una con una cama doble y la otra con dos camas individuales. El salón tiene un sofá cama, ideal para relajarse después de un día de visitas. También cuenta con una televisión para tus momentos de descanso. El baño es completo, con ducha, inodoro y lavabo, garantizando comodidad e intimidad. La cocina está totalmente equipada para que puedas cocinar tus platos favoritos: incluye lavavajillas, microondas, cafetera, cocina eléctrica, horno, frigorífico\/congelador y vitrocerámica. Tendrás todo lo necesario para una estancia agradable. El apartamento también cuenta con comodidades modernas como plancha, secador de pelo, aire acondicionado, calefacción, lavadora, secadora y conexión Wi-Fi gratuita para estar conectado. Además, podrás disfrutar de la terraza y el jardín, perfectos para relajarte, comer al aire libre o simplemente disfrutar del clima de Barcelona. El barrio residencial de Sant Gervasi está bien comunicado con el resto de la ciudad, con estaciones de metro y paradas de autobús cercanas. También está cerca de los barrios animados de Gracia y el Eixample, donde encontrarás numerosos cafés, restaurantes, tiendas y bares para explorar. ¡Estaremos encantados de recibirte y hacer que tu estancia en Barcelona sea una experiencia inolvidable!",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":34.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Gervasi - Galvany, Barcelona",
            "title":"Piso en calle de Marià Cubí, 175"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":11,
        "propertyCode":"105970897",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/93\/d1\/9f\/1288811012.webp",
        "externalReference":"VI-000-030-690-662",
        "numPhotos":19,
        "floor":"3",
        "price":950.0,
        "priceInfo":{
            "price":{
                "amount":950.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1250.0,
                    "priceDropValue":300,
                    "priceDropPercentage":24
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":62.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":1,
        "address":"calle del Congost",
        "province":"Barcelona",
        "municipality":"Hospitalet de Llobregat",
        "district":"La Torrasa",
        "country":"es",
        "neighborhood":"La Torrasa",
        "latitude":41.3729305,
        "longitude":2.128734,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/105970897\/",
        "distance":"3964",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Piso en L'Hospitalet de Llobregat, Barcelona, perfecto para familias. El inmueble cuenta con una superficie de 62 m² construidos distribuidos en tres habitaciones, salón-comedor, cocina y un aseo. Localizado en el centro de L'Hospitalet de Llobregat, en sus alrededores encontramos la Escuela de Cine de Barcelona, supermercados, bancos, farmacias, oficinas de correos, centros deportivos, varias paradas de autobús y la estación de metro Santa Eulàlia. Cuenta con fácil acceso a N-340.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":15.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Torrasa, Hospitalet de Llobregat",
            "title":"Piso en calle del Congost"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":12,
        "propertyCode":"103950490",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/a6\/16\/36\/1205217080.webp",
        "externalReference":"PAT1001SIT",
        "numPhotos":21,
        "floor":"2",
        "price":1350.0,
        "priceInfo":{
            "price":{
                "amount":1350.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1750.0,
                    "priceDropValue":400,
                    "priceDropPercentage":23
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":55.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"Saragossa",
        "province":"Barcelona",
        "municipality":"Sitges",
        "district":"Vinyet-Terramar-Can Pei-Can Girona",
        "country":"es",
        "neighborhood":null,
        "latitude":41.230831,
        "longitude":1.7950943,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/103950490\/",
        "distance":"35952",
        "description":"**ALQUILER POR MESES CON GASTOS INCLUIDOS- DISPONIBLE HASTA 31 DE MAYO 2025** En la zona más residencial y encantadora de Sitges, El Vinyet a 2 min a pie de la playa y 5 min del centro de la ciudad, se alquila por los meses entre Enero y Mayo con todos los gastos de suministros incluidos.  Este encantador piso de dos habitaciones dobles con armarios empotrados te brinda la comodidad y el espacio que necesitas. Disfruta de su amplio salón comedor, cocina equipada con electrodomésticos y un baño con plato de ducha. Además, podrás relajarte en su gran terraza, la cual cuenta con una orientación sur que te permitirá disfrutar del sol durante todo el día.  Dispone de posibilidad de elegir tamaño de camas (individual o king size), calefacción a gas natural por radiadores y aire acondicionado en salón. La lavadora etá en una zona común.  La ubicación de este inmueble es simplemente perfecta. A tan solo 2 minutos a pie de la playa y a 5 minutos del centro de la ciudad, podrás disfrutar de la tranquilidad de la zona sin renunciar a la cercanía de todos los servicios necesarios. El Paseo Marítimo, farmacias, supermercados, hoteles con bares y restaurantes se encuentran a pocos pasos de distancia. Además, la excelente conexión por bus y tren al Aeropuerto y Barcelona te permitirá desplazarte fácilmente.  ¡Contáctanos ahora mismo para más información!",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":25.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Vinyet-Terramar-Can Pei-Can Girona, Sitges",
            "title":"Piso en Saragossa"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":13,
        "propertyCode":"100265982",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/55\/29\/7b\/1075564212.webp",
        "externalReference":"BCN056468104",
        "numPhotos":20,
        "floor":"2",
        "price":3850.0,
        "priceInfo":{
            "price":{
                "amount":3850.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":5000.0,
                    "priceDropValue":1150,
                    "priceDropPercentage":23
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":150.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":3,
        "address":"Barrio Sant Pere - Santa Caterina i la Ribera",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"Sant Pere - Santa Caterina i la Ribera",
        "latitude":41.3870064,
        "longitude":2.179779,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/100265982\/",
        "distance":"572",
        "description":"Esta vivienda reformada con acabados de lujo se encuentra en una de las calles principales del mítico barrio del Born de Barcelona: una zona con mucho encanto que invita a perderse por sus calles medievales, repletas de comercios, restauración y, a su vez, bien comunicado por transporte público. Este piso de 150 m2 conserva elementos originales que aportan calidez, como paredes de piedra y techos de volta catalana con vigas de madera, conjugándose con los más nuevos elementos de alta calidad. La zona de día consta de un espacioso salón con acceso a comedor muy luminoso, que tiene acceso a dos balcones exteriores. Además, esta zona consta de una chimenea, ideal para el invierno. Después, nos encontramos con una cocina independiente que consta de una isla central y está con todos los electrodomésticos necesarios, incluyendo campana extractora, nevera de diseño a dos puertas, microondas y horno. Siguiendo con la zona de noche, encontramos dos magníficas suites con cuarto de baño propio, que cuentan con dos balcones exteriores. Es interesante destacar que la suite principal goza de una chimenea. Adicionalmente, cuenta con otro cuarto baño con suelos de mármol y obras de arte en su interior. El piso está equipado con suelos de parquet natural, aire acondicionado y calefacción por conductos y tomas de internet. Se entrega con todos los muebles y obras de arte mostradas. La finca donde se ubica este bello inmueble está en buen estado y cuenta con ascensor. Además, hay plazas de aparcamiento justo delante del edifico. Los gastos no están incluidos en el precio de alquiler. * Solo alquiler a medio plazo (de 32 días a 11 meses).",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":26.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Pere - Santa Caterina i la Ribera, Barcelona",
            "title":"Piso"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":14,
        "propertyCode":"106295932",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/ef\/b2\/8f\/1278535015.webp",
        "externalReference":"VI-000-030-664-618",
        "numPhotos":43,
        "floor":"2",
        "price":1000.0,
        "priceInfo":{
            "price":{
                "amount":1000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1300.0,
                    "priceDropValue":300,
                    "priceDropPercentage":23
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":142.0,
        "exterior":true,
        "rooms":4,
        "bathrooms":2,
        "address":"calle de Liszt",
        "province":"Barcelona",
        "municipality":"Badalona",
        "district":"La Salut - Lloreda - Sistrells",
        "country":"es",
        "neighborhood":"La Pau",
        "latitude":41.4498589,
        "longitude":2.2196049,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106295932\/",
        "distance":"8166",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Amplio piso en Badalona, Barcelona, idóneo para familias. La vivienda dispone de una superficie de 142 m² construidos distribuidos en cuatro habitaciones, salón-comedor, cocina, un aseo, un baño completo y un balcón. El inmueble es muy luminoso y tiene suelos de parquet que proporcionan al piso de mayor calidez y confort. La finca cuenta con ascensor y además el piso dispone de un trastero incluido en el precio. Está ubicado en el corazón de Badalona, en sus alrededores encontramos el centro sanitario CAP El Fondo, la Escola Joan Miró, supermercados, bancos, bibliotecas, farmacias, oficinas de correos, centros deportivos, varias paradas de autobús y la estación de metro Fondo. Cuenta con fácil acceso a C-31.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":7.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Pau, Badalona",
            "title":"Piso en calle de Liszt"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":15,
        "propertyCode":"106182821",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/51\/e9\/7e\/1275035634.webp",
        "externalReference":"IAUPJoanA",
        "numPhotos":79,
        "floor":"1",
        "price":2700.0,
        "priceInfo":{
            "price":{
                "amount":2700.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3500.0,
                    "priceDropValue":800,
                    "priceDropPercentage":23
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":95.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":2,
        "address":"Barrio La Dreta de l'Eixample",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Dreta de l'Eixample",
        "latitude":41.3917044,
        "longitude":2.1762793,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106182821\/",
        "distance":"772",
        "description":"Piso ALQUILER TEMPORAL. En pleno Eixample derecha ubicado en el Passeig de Sant Joan encontramos este excelente piso totalmente reformado de diseño, amueblado y equipado. Muy amplio y luminoso, para poder disfrutar de la tranquilidad en el centro de Barcelona. Tiene un gran salón comedor con cocina integrada, equipada con electrodomésticos de alta gama. Consta de tres dormitorios, dos de ellos individuales y uno doble. Dos baños completos  Suelos de parquét. Calefacción y aire accondicionado. Edificio con servicio de ascensor. Ubicado en pleno Eixample derecha, en Pº de Sant Joan, muy cerca de Gran Vía, Parque de la Ciudadela y zona Born, en plena zona comercial y con todos los servicios. Perfecta comunicación con todas las líneas de autobuses, metro y ferrocarriles.    * Contacte con nosotros para recibir mayor información y visitar el inmueble.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":28.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Dreta de l'Eixample, Barcelona",
            "title":"Piso"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":16,
        "propertyCode":"105473946",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/4f\/7f\/d4\/1253343292.webp",
        "externalReference":"RS6896",
        "numPhotos":8,
        "floor":"en",
        "price":850.0,
        "priceInfo":{
            "price":{
                "amount":850.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1100.0,
                    "priceDropValue":250,
                    "priceDropPercentage":23
                }
            }
        },
        "propertyType":"studio",
        "operation":"rent",
        "size":45.0,
        "exterior":true,
        "rooms":0,
        "bathrooms":1,
        "address":"calle de Ferran",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"El Gòtic",
        "latitude":41.3820863,
        "longitude":2.1735883,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/105473946\/",
        "distance":"335",
        "description":"Ref. RS6896 ESTUDIO EN BARRIO GOTICO - disponible a partir de 28 de febrero. Alquiler TEMPORAL  - Bonito y tranquilo estudio en la calle Ferran, cuenta con 45m² distribuido en una zona abierta con cama doble, completamente amueblado y equipado con todo lo necesario para entrar a vivir. Baño privado con ducha. - El Barrio Gótico de Barcelona cuenta con numerosos atractivos turísticos para todos los gustos, entre los que podríamos destacar los siguientes: Catedral de Santa Eulalia, Plaza Sant Jaume, Plaza Real, Plaza del Rey, museo Frederic Marès, barrio judío y otros. Esta muy bien comunicado con el transporte público: L4 - Drassanes, L3 - Barceloneta, y líneas de buses V13, 59, V17, D20, H14. Se requieren 2 meses de fianza. Gastos de suministros 150€, no incluidos. Para mas información puede comunicarse con el equipo de RS GROUP.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":19.0,
        "detailedType":{
            "typology":"flat",
            "subTypology":"studio"
        },
        "suggestedTexts":{
            "subtitle":"El Gòtic, Barcelona",
            "title":"Estudio en calle de Ferran"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":17,
        "propertyCode":"105563087",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/e4\/53\/31\/1298308104.webp",
        "externalReference":"PH103188",
        "numPhotos":55,
        "floor":null,
        "price":3500.0,
        "priceInfo":{
            "price":{
                "amount":3500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4500.0,
                    "priceDropValue":1000,
                    "priceDropPercentage":22
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":285.0,
        "exterior":null,
        "rooms":7,
        "bathrooms":6,
        "address":"Urbanizaciones",
        "province":"Barcelona",
        "municipality":"Mataró",
        "district":"Urbanizaciones",
        "country":"es",
        "neighborhood":null,
        "latitude":41.5785471,
        "longitude":2.4348996,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/105563087\/",
        "distance":"30612",
        "description":"Sumérgete en el lujo y la sofisticación con esta exquisita residencia de cuatro plantas completamente amueblada y reformada disponible para alquiler. Ubicada en Mataró en una urbanización con mucha privacidad y tranquilidad, esta casa redefine el concepto de vivir bien. Detalles de la Propiedad: Ubicación: Situada en un entorno tranquilo y seguro, rodeada de áreas verdes y con fácil acceso a las principales vías de comunicación. Diseño y Arquitectura: Esta residencia de estilo contemporáneo cuenta con acabados de primera calidad y un diseño arquitectónico que combina la elegancia clásica con toques modernos. Las amplias ventanas permiten la entrada de luz natural, realzando cada rincón con una cálida luminosidad. Espacios Interiores: - Sala Principal: Un espacio amplio y acogedor con una chimenea central, ideal para reuniones familiares o cenas íntimas. Amueblada con sofás de diseño, mesas de centro elegantes y detalles decorativos que crean una atmósfera única. - Cocinas: La casa cuenta con dos cocinas:  - Cocina Principal: Ubicada en la planta principal, esta cocina gourmet está totalmente equipada con electrodomésticos de última generación, y una gran isla central, convirtiéndose en el corazón del hogar. Incluye menaje completo y mobiliario de alta gama. - Comedor Un espacio elegante junto a la cocina abierta con capacidad para diez comensales, perfecto para cenas y eventos sociales. Decorado con una mesa de comedor de alta gama.  - Cocina Secundaria:** Situada en la planta baja con acceso directo a la piscina, perfecta para preparar comidas y bebidas durante los días de verano. También completamente equipada y diseñada para la máxima comodidad. - Dormitorios: La casa cuenta con siete lujosos dormitorios. Cuatro de estos dormitorios tienen su propio baño en suite y walk-in closet. El dormitorio principal incluye un salón con acceso directo a la piscina está equipado con una cama queen mesitas de noche y armarios empotrados. - Baños: En total, la casa dispone de cinco baños completos, diseñados con detalles modernos, duchas de lluvia, así como un aseo adicional para visitas. Todos los baños están equipados con toallas y accesorios de baño de alta calidad. Espacios Exteriores: - Jardín Privado: Un oasis de tranquilidad con paisajismo profesional, una piscina de agua cristalina y una terraza cubierta, ideal para disfrutar de tardes soleadas y noches estrelladas. Mobiliario de exterior incluido. - Área de Barbacoa: Perfectamente equipada para organizar barbacoas y reuniones al aire libre. - Garaje: Espacio para dos coches. Extras: Sistema de climatización central, (aerotermia) tecnología domótica. Por qué Esta Casa es la Elección Perfecta: Cada detalle ha sido cuidadosamente pensado para ofrecer una experiencia de vida inigualable. Esta residencia no solo proporciona un espacio donde vivir, sino un lugar donde disfrutar del verdadero significado del lujo y el confort. Al estar completamente amueblada y distribuida en cuatro plantas, está lista para que te mudes sin preocupaciones y empieces a disfrutar de inmediato. ¡No pierdas la oportunidad de vivir en la casa de tus sueños! Contacta hoy mismo para más información y agenda una visita.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":12.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"independantHouse"
        },
        "suggestedTexts":{
            "subtitle":"Urbanizaciones, Mataró",
            "title":"Casa independiente"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":18,
        "propertyCode":"39554645",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/af\/65\/8c\/992861601.webp",
        "externalReference":"12807",
        "numPhotos":30,
        "floor":null,
        "price":14000.0,
        "priceInfo":{
            "price":{
                "amount":14000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":18000.0,
                    "priceDropValue":4000,
                    "priceDropPercentage":22
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":400.0,
        "exterior":null,
        "rooms":6,
        "bathrooms":4,
        "address":"Cunit",
        "province":"Barcelona",
        "municipality":"Gavà",
        "district":"Gavà Mar",
        "country":"es",
        "neighborhood":null,
        "latitude":41.269841,
        "longitude":2.0240537,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/39554645\/",
        "distance":"17881",
        "description":"Una oportunidad única, un chalet reformado en alquiler a 100 m de la playa en Gava Mar, a 22 km de Barcelona. Inmejorable ubicación cerca de las tiendas, colegios internacionales, aeropuerto de Barcelona. Gava Mar es una zona de gran prestigio y una perfecta opción de residencia permanente. Es una opción perfecta para las grandes familias, ya que en esta zona hay todo lo necesario desde los abundantes parques infantiles hasta los mejores colegios, como, por ejemplo, The British School. Es un pueblo tranquilo, pero una de sus ventajas principales es la cercanía de Barcelona, 15 minutos en coche o en tren. Las características y el tamaño del chalet es ideal para una familia grande, cada miembro tendrá mucha privacidad y su espacio propio, decorado con muy buen gusto. El chalet cuenta con la superficie de 400 m2. La zona de noche está formada por 5 dormitorios, un cómodo estudio, y 4 baños modernos. La zona social donde desarrollan actividades del día y se reúne toda la familia, consta con un amplio salón que fluye hasta la abierta cocina americana, perfectamente equipada y con mucho espacio para trabajar. El chalet cuenta con varias terrazas que en total suman 100 m2 donde se puede desconectar y disfrutar del aire puro y bonitas vistas. En el sótano se encuentra un amplio garaje donde caben 3-4 coches. En total, el chalet tiene todo lo necesario para llevar una vida cómoda. El estado del chalet y su aspecto estético son impecables. Una reforma integral del chalet se llevó a cabo en el 2016. Los interiores están decorados con mucho gusto y de estilo moderno. Los exteriores están a la altura. El chalet está sobre una generosa parcela de 860 m2 con precioso jardín de árboles frutales y una piscina de 60 m2 con función de contracorriente y masaje.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":35.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"independantHouse"
        },
        "suggestedTexts":{
            "subtitle":"Gavà Mar, Gavà",
            "title":"Casa independiente en Cunit"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":19,
        "propertyCode":"105831957",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/99\/de\/e6\/1264338775.webp",
        "externalReference":null,
        "numPhotos":35,
        "floor":"5",
        "price":975.0,
        "priceInfo":{
            "price":{
                "amount":975.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1250.0,
                    "priceDropValue":275,
                    "priceDropPercentage":22
                }
            }
        },
        "propertyType":"studio",
        "operation":"rent",
        "size":23.0,
        "exterior":true,
        "rooms":0,
        "bathrooms":1,
        "address":"calle Doctor Zamenhoff, 9",
        "province":"Tarragona",
        "municipality":"Tarragona",
        "district":"Nou Eixample Sud",
        "country":"es",
        "neighborhood":null,
        "latitude":41.1132749,
        "longitude":1.2462141,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/105831957\/",
        "distance":"83194",
        "description":"Alquiler Temporal Unik Vacation Zamenhoff. Se ofrece alojamiento de 1-5 meses, con todos los servicios incluidos (luz, agua y Wifi), sábanas y toallas, y una limpieza semanal también incluida. Características del apartamento: - Estudio - 1 baño. - 1 cocina completamente equipada. - Smart Tv. - Wifi de alta velocidad (300mbps). - 5a planta con ascensor. Ubicación y zona: El apartamento se encuentra en el centro de Tarragona, muy cerca del mercado. Una zona completamente actualizada cerca de todos los servicios: restaurantes, supermercados, bares, farmacias, tiendas, etc.  Si estás interesado en alojamiento de 1-5 meses podemos ayudarte.  Puedes visitarnos en Cavallers, 6, Tarragona, o contactarnos para más información.  Unik Vacation.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":42.0,
        "detailedType":{
            "typology":"flat",
            "subTypology":"studio"
        },
        "suggestedTexts":{
            "subtitle":"Nou Eixample Sud, Tarragona",
            "title":"Estudio en calle Doctor Zamenhoff, 9"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":20,
        "propertyCode":"106507978",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/33\/d3\/9f\/1291960415.webp",
        "externalReference":"VI-000-030-679-928",
        "numPhotos":28,
        "floor":"4",
        "price":1400.0,
        "priceInfo":{
            "price":{
                "amount":1400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1790.0,
                    "priceDropValue":390,
                    "priceDropPercentage":22
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":91.0,
        "exterior":true,
        "rooms":4,
        "bathrooms":1,
        "address":"calle de Numància",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Les Corts",
        "country":"es",
        "neighborhood":"Les Corts",
        "latitude":41.3842046,
        "longitude":2.1363023,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106507978\/",
        "distance":"3096",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Piso en Barcelona, idóneo para parejas. La vivienda dispone de una superficie de 91 m² construidos distribuidos en cuatro habitaciones, salón-comedor, cocina y un aseo. Localizado en el corazón de Barcelona, muy cerca de Avinguda Diagonal en el barrio de Les Corts. En sus alrededores encontramos el Hospital de Barcelona, el EU Business School Barcelona | Diagonal Campus, supermercados, bancos, bibliotecas, farmacias, oficinas de correos, centros deportivos, varias paradas de autobús, la estación de metro Les Corts y la estación de tren Barcelona-Sants.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":15.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Les Corts, Barcelona",
            "title":"Piso en calle de Numància"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":21,
        "propertyCode":"105972155",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/51\/36\/cb\/1285457763.webp",
        "externalReference":"VI-000-030-680-471",
        "numPhotos":27,
        "floor":"1",
        "price":1300.0,
        "priceInfo":{
            "price":{
                "amount":1300.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1650.0,
                    "priceDropValue":350,
                    "priceDropPercentage":21
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":92.0,
        "exterior":true,
        "rooms":4,
        "bathrooms":1,
        "address":"calle de la Riera d'Horta",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sant Andreu",
        "country":"es",
        "neighborhood":"El Congrés i els Indians",
        "latitude":41.4272813,
        "longitude":2.1816936,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/105972155\/",
        "distance":"4740",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Piso en Barcelona, perfecto para familias. La vivienda cuenta con una superficie de 92 m² construidos distribuidos en cuatro habitaciones, salón-comedor, cocina y un aseo. Cuenta con todos los servicios necesarios a su alrededor, como el Hospital del Nen Déu, el Euncet Business School - Campus Barcelona Norte, supermercados, bancos, bibliotecas, farmacias, oficinas de correos, centros deportivos, la estación de metro Fabra i Puig y la estación de tren Sant Andreu Arenal. Cuenta con fácil acceso a Ronda de Dalt.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":14.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Congrés i els Indians, Barcelona",
            "title":"Piso en calle de la Riera d'Horta"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":22,
        "propertyCode":"104918099",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/3b\/f3\/8c\/1236107784.webp",
        "externalReference":"0703",
        "numPhotos":11,
        "floor":"4",
        "price":1100.0,
        "priceInfo":{
            "price":{
                "amount":1100.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1400.0,
                    "priceDropValue":300,
                    "priceDropPercentage":21
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":35.0,
        "exterior":true,
        "rooms":1,
        "bathrooms":2,
        "address":"Barrio La Barceloneta",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"La Barceloneta",
        "latitude":41.3827477,
        "longitude":2.1891527,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/104918099\/",
        "distance":"1339",
        "description":"Contratos temporales Cuarta planta reformada de 35 m2 aprox. totalmente amueblado y equipado. Consta de una cocina americana, 1 dormitorio doble, salón-comedor, baño y balcón.  La propiedad tiene una excelente ubicación, situado en el barrio de La Barceloneta, zona con muchos comercios y gran variedad de servicios de ocio (bares, restaurantes,. ). Se encuentra a 5 minuto a pie de la playa, a 2 minutos la parada de metro Barceloneta y la estación de tren, y a 10 minutos del centro. Disponibilidad: 03\/02\/2025 Condiciones: Renta mes en curso (suministros a parte) + Fianza: 2 meses + Honorarios agencia: 1 mes (+IVA) + Contrato: 250 € (+IVA) [IW].",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":31.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Barceloneta, Barcelona",
            "title":"Piso"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":23,
        "propertyCode":"106961240",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/f5\/40\/6e\/1298805729.webp",
        "externalReference":"1311",
        "numPhotos":11,
        "floor":"1",
        "price":1400.0,
        "priceInfo":{
            "price":{
                "amount":1400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1750.0,
                    "priceDropValue":350,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":30.0,
        "exterior":true,
        "rooms":1,
        "bathrooms":1,
        "address":"calle d'Espronceda",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sant Martí",
        "country":"es",
        "neighborhood":"El Poblenou",
        "latitude":41.4043961,
        "longitude":2.2050745,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106961240\/",
        "distance":"3403",
        "description":"¡DISPONIBLE A PARTIR DE FEBRERO! ¡IMPRESIONANTE ESTUDIO EN COLIVING! ¡ALQUILER DESDE TRES MESES! ¡GASTOS INCLUIDOS! ¿Buscas un bonito lugar donde vivir y compartir sinergias con gente joven como tú? Creamos espacios con las mejores instalaciones, para facilitar tu día a día y hacerlo más flexible y sencillo.. . Atentos a nuestra propuesta de servicios, todo incluido: - Gastos incluidos (electricidad, internet, agua, gas) - Limpieza zonas comunes 1 vez a la semana (pasillos, baños, cocina y salón) - Flexibilidad de contratos, desde 3 meses - Fianza de 1 mes a devolver al finalizar contrato - Artículos de limpieza mensuales incluidos para los inquilinos - Estancias de calidad en diseño y comodidad del mobiliario - Servicio de atención al cliente y mantenimiento a través de nuestra APP El Co-living cuenta con una cocina completamente equipada para que no necesites comprar nada, además de lavadora, frigorífico, lavavajillas, microondas y horno. Sant Martí es un barrio de Barcelona que combina tradición y modernidad. Situado al noreste de la ciudad, es conocido por sus amplias avenidas y espacios verdes, como el Parc de la Ciutadella. Históricamente, fue una zona industrial, pero en las últimas décadas ha experimentado una transformación significativa, convirtiéndose en un área de desarrollo tecnológico y residencial.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":47.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Poblenou, Barcelona",
            "title":"Piso en calle d'Espronceda"
        },
        "hasPlan":false,
        "has3DTour":true,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":24,
        "propertyCode":"106209476",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/c8\/66\/9b\/1275905327.webp",
        "externalReference":"W-02XCF0",
        "numPhotos":31,
        "floor":"3",
        "price":2200.0,
        "priceInfo":{
            "price":{
                "amount":2200.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2750.0,
                    "priceDropValue":550,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":90.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"Passatge de la Virreina",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"El Raval",
        "latitude":41.3836268,
        "longitude":2.1718824,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106209476\/",
        "distance":"207",
        "description":"Piso temporal en el Gótico Decorado con las típicas baldosas hidráulicas y con las vigas de madera al descubierto, los techos altos delatan el origen noble de esta luminosa vivienda, ubicada en la planta …… del edificio que, al ser antiguo, no cuenta con ascensor. Al entrar al apartamento te encontrarás inmediatamente en un gran espacio central que hace las veces de distribuidor y de punto de reunión para las comidas o para trabajar o estudiar en una de sus mesas.  De ahí se accede al baño, todo nuevo y reformado, con ducha; a la cocina, perfectamente equipada con todos los electrodomésticos necesario; y al pequeño salón con su sofá y su televisor.  Del pequeño salón se accede a los dos amplios y hermosos dormitorios con cama matrimonial y grandes armarios, uno de los cuales cuenta con una mezzanina a la que poder subir cuando tengas ganas de desconectar y relajarte a leer un libro o escuchar música. Una vez instalados, no te faltarán alicientes para salir a la calle a explorar la zona. Estás junto al mercado de la Boquería; de hecho, puedes contemplar las paradas desde los grandes ventanales del apartamento. ¿Te imaginas desayunando cada día en alguna de estas paradas? Cinco pasos más y estás en Las Ramblas, la calle más icónica y representativa de Barcelona. Pasea rambla abajo para acabar en el mar, o rambla arriba para llegar a Rambla Catalunya, la hermana sofisticada de las Ramblas. O sumérgete por las callejuelas del barrio del Raval, el barrio más auténtico y gamberro de la ciudad, o por el barrio gótico, el barrio con más historia. El apartamento está ubicado en el distrito más antiguo de Barcelona: El Barri Gòtic.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":24.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Raval, Barcelona",
            "title":"Piso en Passatge de la Virreina"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":25,
        "propertyCode":"106231572",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/14\/fe\/9f\/1276635394.webp",
        "externalReference":"AB2410038-1",
        "numPhotos":42,
        "floor":"10",
        "price":3400.0,
        "priceInfo":{
            "price":{
                "amount":3400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4250.0,
                    "priceDropValue":850,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":106.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":2,
        "address":"calle de Llull",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sant Martí",
        "country":"es",
        "neighborhood":"Diagonal Mar i el Front Marítim del Poblenou",
        "latitude":41.409695,
        "longitude":2.2127929,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106231572\/",
        "distance":"4274",
        "description":"PISO EN ALQUILER, DE 3 HABITACIONES, AMUEBLADO Este fantástico piso de 3 habitaciones y 2 baños situado en un edificio Illa del Cel de Diagonal Mar, dispone de todo lo necesario para vivir con estilo en Barcelona y estar a un minuto de las playas y del mar. Consta de un amplio salón-comedor con salida a una maravillosa y amplia terraza de 15m2, perfecta para disfrutar durante todo el año, y una moderna cocina americana totalmente equipada. La zona de noche consta de 3 dormitorios, uno de ellos con baño en suite, y otro baño con bañera, se entrega amueblado. La finca dispone de una maravillosa zona comunitaria con piscina, zona de recreo infantil y un gimnasio recién estrenado. La propiedad dispone de parking para coche y moto en la misma finca. Disponible para entrar 1 de noviembre 2024. La realidad del mobiliario puede no corresponder exactamente con las fotografías mostradas en este anuncio.  Contacte con nosotros para ver más inmuebles similares. * En cumplimiento de la Ley 12\/2023 y la Llei 18\/2007 informamos que: Índice de R. P. LL: 18,00 € \/ m2 Precio de referencia estatal 2.550, 00 €.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":32.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Diagonal Mar i el Front Marítim del Poblenou, Barcelona",
            "title":"Piso en calle de Llull"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":26,
        "propertyCode":"97234102",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/eb\/3e\/15\/973087350.webp",
        "externalReference":"005574",
        "numPhotos":40,
        "floor":null,
        "price":2000.0,
        "priceInfo":{
            "price":{
                "amount":2000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2500.0,
                    "priceDropValue":500,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":80.0,
        "exterior":null,
        "rooms":2,
        "bathrooms":2,
        "address":"calle Joan Rebull",
        "province":"Girona",
        "municipality":"Sant Feliu de Guíxols",
        "district":"Sant Pol - Volta de l'Ametller",
        "country":"es",
        "neighborhood":null,
        "latitude":41.7873096,
        "longitude":3.0415309,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/97234102\/",
        "distance":"84926",
        "description":"La Llar Finques Montornés alquila fabulosa CASA ADOSADA CON PISCINA PRIVADA y JARDÍN. La vivienda se encuentra ubicada en zona residencial de S'AGARÓ, situada en SEGUNDA LÍNEA DE MAR.  ¡LA MEJOR ZONA DE LA COSTA BRAVA! La casa de dos plantas está interiorizada con mucho amor, totalmente REFORMADA y equipada estilo nórdico, dispone de todo lo necesario para una estancia agradable. Consta de 2 habitaciones dobles con TV, salón-comedor con aire acondicionado, TV con conexión a Netflix, cocina-office con microondas y cafetera \"Nespresso\", 1 baño completo con plato de ducha y aseo.   Toda la vivienda está equipada con mobiliario y electrodomésticos (lavavajillas, microondas, lavadora-secadora, calentador de agua eléctrico, dos aires acondicionados y dos TV de plasma), DECORADA Y REFORMADA con mucho encanto, desde el salón se accede mediante el gran ventanal al jardín privado de 60 m2, con toldo eléctrico y la piscina privada. ¡Ideal para hacer vida en el exterior disfrutando del buen tiempo! Dispone de barbacoa, lavadero con lavadora y secadora. Y con un patio trasero, para 2 plazas de aparcamiento en la zona residencial. La urbanización privada (Sant Pol) es de un ambiente familiar, donde los niños pequeños y grandes pueden jugar sin ningún riesgo, dispone de zona de juegos y es ideal y fantástica por su ubicación privilegiada a 3 minutos ( 100m) a pie de la playa de Sant Pol. ¡PERFECTA UBICACIÓN! En segunda línea de MAR junto a Cala Masset, Platja de Sant Pol y camino de ronda.  Siguiendo por el camino de ronda encontraremos la cala Niu en la que permiten PERROS.  ¡La vivienda está rodeada de calas y piscinas naturales! -Condiciones de contrato: Contratos por semanas. -TEMPORADA DE VERANO: 3.000€\/SEMANALES (pago por adelantado). -TEMPORADA DE VERANO: 430€\/DIA (pago por adelantado). **RESERVADA DEL 8 AL 15 DE JULIO DE 2024** -DISPONIBILIDAD DE LA CASA: MESES JULIO Y AGOSTO. ¡EN LA LLAR FINQUES GARANTIZAMOS SU HOGAR AL MEJOR PRECIO!  ¡PARA REALIZAR VISITAS NOS ADAPTAMOS A SU HORARIO! PODRÁ ENCONTRARNOS EN LA AVENIDA ONCE DE SEPTIEMBRE Nº30, MONTORNÉS DEL VALLÉS.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":25.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"terracedHouse"
        },
        "suggestedTexts":{
            "subtitle":"Sant Pol - Volta de l'Ametller, Sant Feliu de Guíxols",
            "title":"Chalet adosado en calle Joan Rebull"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":27,
        "propertyCode":"106607865",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/ba\/70\/94\/1288520409.webp",
        "externalReference":"PIS5106A",
        "numPhotos":28,
        "floor":"2",
        "price":1600.0,
        "priceInfo":{
            "price":{
                "amount":1600.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2000.0,
                    "priceDropValue":400,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":70.0,
        "exterior":true,
        "rooms":4,
        "bathrooms":1,
        "address":"calle de Llull",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sant Martí",
        "country":"es",
        "neighborhood":"El Poblenou",
        "latitude":41.3979273,
        "longitude":2.2003339,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106607865\/",
        "distance":"2661",
        "description":"CONTRATO POR TEMPORADA. SE ALQUILARÁ A ESTUDIANTES DE UNIVERSIDAD, MASTER O ERASMUS. SE SOLICITARÁN DOCUMENTOS QUE LO ACREDITEN. Piso de 70m² en alquiler por temporada en calle Llull. Finca regia, segunda planta real sin ascensor. Tiene 4 habitaciones: 3 habitaciones dobles ( 2 de ellas exteriores a calle con balcones) y 1 habitación individual con salida a galería. Dispone de recibidor, cocina independiente, salón-comedor y un cuarto de baño completo con plato de ducha. Techos altos artesonados y suelo hidráulico de mosaico.  Dispone de calefacción por radiadores. Gastos de comunidad e IBI incluidos en el precio de alquiler. Fianzas: 2 meses según LAU. Transporte público: parada de metro Poblenou y amplia red de autobuses en zona. Los honorarios irán a cargo de los inquilinos.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":23.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Poblenou, Barcelona",
            "title":"Piso en calle de Llull"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":28,
        "propertyCode":"106802136",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/1a\/ab\/51\/1294448918.webp",
        "externalReference":"5676",
        "numPhotos":25,
        "floor":"2",
        "price":3200.0,
        "priceInfo":{
            "price":{
                "amount":3200.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4000.0,
                    "priceDropValue":800,
                    "priceDropPercentage":20
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":133.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":2,
        "address":"calle de Sèneca",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Gràcia",
        "country":"es",
        "neighborhood":"Vila de Gràcia",
        "latitude":41.3956356,
        "longitude":2.1562633,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106802136\/",
        "distance":"1848",
        "description":"¡Descubre tu nuevo hogar en el corazón de Gracia! Este impresionante piso de 130 m² te ofrece una experiencia única en una de las zonas más exclusivas y vibrantes de Barcelona. A solo unos pasos del emblemático Paseo de Gracia, estarás rodeado de bares, restaurantes, tiendas de lujo y lugares turísticos icónicos. El apartamento cuenta con tres habitaciones, incluyendo una suite con baño privado y bañera, así como dos habitaciones dobles, todas ellas decoradas con un diseño que fusiona lo moderno con lo antiguo. Los techos altos aportan un toque mágico y único a cada espacio, mientras que la cocina completamente equipada y el amplio salón te invitan a relajarte y disfrutar de momentos inolvidables. Además, podrás disfrutar del aire fresco en su terraza y balcón. Este piso se presenta completamente amueblado con materiales de calidad, listo para que te instales y vivas con estilo y comodidad. Situado en la planta 4 de un edificio con ascensor, dispone de calefacción por bomba de frío\/calor y aire acondicionado para tu confort en cualquier estación del año. No pierdas la oportunidad de vivir en este exclusivo piso que combina elegancia y funcionalidad. Con armarios empotrados, segunda mano en buen estado, y eficiencia energética clase E, este es el lugar ideal para aquellos que buscan una vida urbana sin renunciar al confort. ¡Ven a conocerlo y enamórate de tu nuevo hogar en el corazón de Barcelona!",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":24.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Vila de Gràcia, Barcelona",
            "title":"Piso en calle de Sèneca"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":29,
        "propertyCode":"101082925",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/87\/90\/ce\/1109423201.webp",
        "externalReference":"Pm579",
        "numPhotos":39,
        "floor":"1",
        "price":2600.0,
        "priceInfo":{
            "price":{
                "amount":2600.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3200.0,
                    "priceDropValue":600,
                    "priceDropPercentage":19
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":113.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":1,
        "address":"Maritimo",
        "province":"Barcelona",
        "municipality":"Badalona",
        "district":"Port",
        "country":"es",
        "neighborhood":null,
        "latitude":41.4428724,
        "longitude":2.2453218,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/101082925\/",
        "distance":"8788",
        "description":"Alquiler temporal hasta 11 meses, para gente trasladada por trabajo! o estudios, etc! Precioso piso con zona comunitaria con solarium, piscina! y parking! Y una muy hermosa gran terraza de Uso exclusivo, Al lado del puerto deportivo de Badalona, espectaculares vistas al mar y playa, ubicado en primera línea de mar, a 5 min en coche del Front  Maritim de Poblenou, y centro comercial! y centro de Badalona. Se alquilara completamente amueblado, Posibilidad de alquiler de plaza de parking en el edificio! Esta ubicado a 20 min en tren o metro de pleno centro de Barcelona Estará listo para entrar a vivir a mediados de febrero! Consta con excelente salón comedor con salida a gran balcón terraza y una terraza muy grande con vistas directas al mar. 2 dormitorios, hay un tercer dormitorio, pero se usa para almacen del propietario mar,  1 excelente baño. Muy buena cocina con Office en galería acristalada en balcón, equipada con electrodomésticos. Dispone de calefacción, suelos de parquet, ventanas de doble acristalamiento, etc Se puede visitar!",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":23.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Port, Badalona",
            "title":"Piso en Maritimo"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":30,
        "propertyCode":"106509974",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/15\/0e\/9c\/1285025893.webp",
        "externalReference":"GC02316",
        "numPhotos":5,
        "floor":"5",
        "price":1400.0,
        "priceInfo":{
            "price":{
                "amount":1400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1730.0,
                    "priceDropValue":330,
                    "priceDropPercentage":19
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":86.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":1,
        "address":"Barrio El Baix Guinardó",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Horta Guinardó",
        "country":"es",
        "neighborhood":"El Baix Guinardó",
        "latitude":41.4113046,
        "longitude":2.1608219,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106509974\/",
        "distance":"3096",
        "description":"Alquiler temporal con una duración no superior a 11 meses.  Posibilidad de amueblar en el plazo máximo de 15 días. Piso en Barcelona. Dispone de una superficie de 93 m² construidos distribuidos en 3 habitaciones, salón-comedor con salida a una terraza, cocina amueblada con acceso al lavadero y 1 baño completo con plato de ducha. Cuenta con suelos de parquet.  Edificio con ascensor.  Situado en el barrio Can Baró, cerca de comercios, restaurantes, supermercados, centros educativos, centros sanitarios, zonas verdes y paradas de autobús. Con fácil acceso al metro Alfons X y la B-20. No te pierdas esta oportunidad. ¿Vienes a conocerlo? Llámanos y prepararemos encantados una visita. En Guimar somos expertos en la zona de Barcelona y Baix Llobregat.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":16.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Baix Guinardó, Barcelona",
            "title":"Piso"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":31,
        "propertyCode":"104359499",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/9f\/2a\/0c\/1280656971.webp",
        "externalReference":"OFSA10360",
        "numPhotos":24,
        "floor":"1",
        "price":2200.0,
        "priceInfo":{
            "price":{
                "amount":2200.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2700.0,
                    "priceDropValue":500,
                    "priceDropPercentage":19
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":90.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"calle del Doctor Aiguader, 3",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"Sant Pere - Santa Caterina i la Ribera",
        "latitude":41.382642,
        "longitude":2.1861756,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/104359499\/",
        "distance":"1100",
        "description":"AICAT 7197 - ANCORA REAL ESTATE Para más información contacte con nuestro equipo comercial, atenderemos todas las solicitudes pero daremos prioridad a aquellas en las que se nos facilite un teléfono de contacto. Visita nuestra área privada accediendo a través de nuestro logo en este mismo anuncio para poder ver el resto de nuestra cartera de inmuebles. ** Alquiler de temporada** Este luminoso piso de dos habitaciones y dos baños es una joya que destaca por su amplitud y diseño cuidado. Cada rincón está bañado por la luz natural que fluye a través de sus generosas ventanas, creando un ambiente cálido y acogedor. La distribución inteligente del espacio asegura que cada habitación sea funcional y cómoda. La cocina, de estilo moderno y totalmente equipada, invita a la creatividad culinaria, mientras que la sala de estar, con su diseño contemporáneo, es el lugar perfecto para relajarse y disfrutar de momentos de tranquilidad. Las dos habitaciones, luminosas y bien ventiladas, proporcionan un refugio tranquilo para el descanso. Los dos baños, elegantemente diseñados, ofrecen comodidad y estilo. Además, detalles adicionales como armarios empotrados completan esta encantadora residencia. La zona de Doctor Aiguader en Barceloneta es una ubicación excepcional para hospedarse, ofreciendo una combinación única de encanto costero y proximidad a importantes atracciones de Barcelona. Aquí tienes una descripción: Situada en el corazón de Barceloneta, la zona de Doctor Aiguader se caracteriza por su cercanía a la playa y su acceso rápido a diversas comodidades. Los visitantes disfrutarán de la conveniencia de tener la playa a pocos pasos, permitiendo relajarse en la arena o disfrutar de actividades acuáticas. Además de la playa, la zona cuenta con una variedad de restaurantes, bares y cafeterías que ofrecen delicias culinarias locales e internacionales. Pasear por las calles cercanas revela el encanto auténtico del barrio con sus estrechas calles adoquinadas, tiendas pintorescas y animado ambiente marítimo. La proximidad al Puerto Olímpico y al Parc de la Ciutadella añade un atractivo adicional a la zona, proporcionando oportunidades para actividades al aire libre y exploración cultural. La red de transporte público cercana facilita el desplazamiento hacia otras partes de la ciudad, brindando acceso a famosos lugares de interés, como La Rambla o la Sagrada Familia.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":24.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Pere - Santa Caterina i la Ribera, Barcelona",
            "title":"Piso en calle del Doctor Aiguader, 3"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":32,
        "propertyCode":"106507241",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/a2\/55\/19\/1291513585.webp",
        "externalReference":"VI-000-030-680-004",
        "numPhotos":25,
        "floor":"4",
        "price":1400.0,
        "priceInfo":{
            "price":{
                "amount":1400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1730.0,
                    "priceDropValue":330,
                    "priceDropPercentage":19
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":93.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":1,
        "address":"calle de Sardenya",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Horta Guinardó",
        "country":"es",
        "neighborhood":"El Baix Guinardó",
        "latitude":41.4134303,
        "longitude":2.1632801,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106507241\/",
        "distance":"3261",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Piso en Barcelona. Dispone de una superficie de 93 m² construidos distribuidos en 3 habitaciones, salón-comedor con salida a una terraza, cocina amueblada con acceso al lavadero y 1 baño completo con plato de ducha. Cuenta con suelos de parquet. Edificio con ascensor. Situado en el barrio Can Baró, cerca de comercios, restaurantes, supermercados, centros educativos, centros sanitarios, zonas verdes y paradas de autobús. Con fácil acceso al metro Alfons X y la B-20.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":15.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Baix Guinardó, Barcelona",
            "title":"Piso en calle de Sardenya"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":33,
        "propertyCode":"92030007",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/af\/04\/3f\/829056925.webp",
        "externalReference":"Pau Claris II",
        "numPhotos":13,
        "floor":"en",
        "price":2295.0,
        "priceInfo":{
            "price":{
                "amount":2295.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2850.0,
                    "priceDropValue":555,
                    "priceDropPercentage":19
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":51.0,
        "exterior":false,
        "rooms":1,
        "bathrooms":1,
        "address":"calle de Pau Claris, 76",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Dreta de l'Eixample",
        "latitude":41.3895187,
        "longitude":2.1717544,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/92030007\/",
        "distance":"510",
        "description":"¡Disponible a partir de DICIEMBRE! Moderno apartamento Homeclub en alquiler mensual ¡Ideal para estancias temporales con todas las comodidades incluidas! Incluye en el precio: - Electricidad (hasta 120 €\/mes), Gas (hasta 120 €\/mes) e Internet de alta velocidad. - Sin comisión de agencia. La tarifa de servicio del 4% (IVA incluido) no está incluida en el precio. Precios ajustables según la duración de la estancia: Los precios indicados corresponden a estancias de 12 meses o más y pueden variar según la temporada. Disponemos de opciones flexibles de alquiler: - 1 a 3 meses: 2550 €\/mes - 4 a 8 meses: 2423 €\/mes - 9 a 11 meses: 2359 €\/mes - Más de 12 meses: 2295 €\/mes Descuento para estancias largas: Aprovecha tarifas reducidas para alquileres prolongados. ¡Cuánto más larga sea tu estancia, mayor será el descuento! Totalmente amueblado y equipado: El apartamento se entrega tal cual aparece en las fotos, con un estilo moderno, decorado con gusto y equipado con todo lo necesario, incluyendo ropa de cama y toallas. Para tu tranquilidad, se solicitará un depósito de seguridad, que será reembolsado hasta 10 días después de la salida, siempre y cuando el apartamento se encuentre en buen estado. DESCRIPCIÓN: ste apartamento está a unos metros de algunos de los lugares más emblemáticos de la ciudad, como son la Casa Batlló y la Casa Milá. Un lugar totalmente exclusivo para vivir la experiencia más auténtica de Barcelona. La ubicación es tan céntrica que hay pocos lugares que no estén cerca de este alojamiento. En cuanto al interiorismo, puedes esperar los mas altos estándares de calidad, tanto en los muebles como en la decoración, con los que se ha creado un conjunto agradable que te harán sentir como en tu propia casa. Los amplios ventanales bañan de luz cada rincón del apartamento durante todo el día, y esta luminosidad además se potencia con el uso de tonos claros en las superficies. En el salón, la disposición de los muebles y elementos de decoración abren los espacios, y la calidad de las alfombras hacen que hasta caminar por el piso sea un lujo. El toque de color y naturalidad de las plantas completa a la perfección todo el conjunto. La situación de este apartamento, en el gran barrio del Eixample, es idónea, ya que los puntos de mayor interés de la ciudad están apenas a un paseo de distancia. EL ESPACIO: Salón\/ Comedor  justo en frente de la cocina se ha dispuesto una elegante mesa de comedor, que se puede usar también como espacio de trabajo. Este apartamento es ideal para vivir y trabajar con estilo en el centro de la ciudad. Cocina La elegante cocina, decorada en tonos oscuros, viene totalmente equipada con todo lo que puedas necesitar, incluyendo horno, nevera, fogones, lavavajillas y lavadora \/ secadora. Dormitorio En el acogedor dormitorio principal tienes una cama doble Queen Size, con suaves sábanas de primera calidad, y dispone de mucho espacio de almacenaje. Se ha decorado con una agradable alfombra, que ayuda a crear un espacio idóneo para relajarse después de un largo día. Baño El impecable baño, con modernos azulejos, dispone de ducha, y a tu llegada lo encontrarás equipado con toallas y artículos de tocador de marca, para que no tengas que preocuparte por nada. CONTACTO Y DISPONIBILIDAD: Para verificar la disponibilidad y recibir más información, no dudes en ponerte en contacto con nosotros: H o m e c l u b. c o m.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":45.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Dreta de l'Eixample, Barcelona",
            "title":"Piso en calle de Pau Claris, 76"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":34,
        "propertyCode":"106571673",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/f1\/25\/9d\/1287160509.webp",
        "externalReference":"AB2411040-1",
        "numPhotos":50,
        "floor":null,
        "price":4000.0,
        "priceInfo":{
            "price":{
                "amount":4000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4900.0,
                    "priceDropValue":900,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":100.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"calle de Sardenya",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Sagrada Família",
        "latitude":41.4045224,
        "longitude":2.1741832,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106571673\/",
        "distance":"2160",
        "description":"ÁTICO DE LUJO A ESTRENAR, CON VISTAS ÚNICAS A LA SAGRADA FAMILIA Y 2 EXCLUSIVAS TERRAZAS Lujoso piso en Barcelona, completamente reformado y listo para estrenar,   con materiales de alta calidad, diseñado hasta el último detalle. Esta exclusiva propiedad combina el lujo, el confort y vistas panorámicas de 360º de la ciudad, con una ubicación privilegiada para disfrutar de la Sagrada Familia y el paisaje urbano. Al entrar, encontrarás un amplio y luminoso salón-comedor con acceso directo a una terraza de 24 m². Equipado con barbacoa eléctrica, ducha exterior, comedor y una zona chill-out, este espacio es perfecto para disfrutar de los días soleados de Barcelona con familia y amigos. Desde aquí, podrás contemplar el Tibidabo, la Sagrada Familia y vistas impresionantes de la ciudad. Cocina abierta, totalmente equipada con electrodomésticos de alta calidad, vinoteca, lavadora\/secadora y cada detalle pensado para la máxima comodidad. La propiedad cuenta con dos dormitorios dobles, iluminados y acogedores. La suite principal incluye un baño completo con ducha, armarios empotrados y acceso a una segunda terraza privada de 10 m² con vistas inigualables. El segundo dormitorio también es espacioso y cuenta con armarios empotrados y vistas privilegiadas. Este dormitorio tiene acceso a un segundo baño completo que también funciona como baño de cortesía. Esta vivienda se entrega completamente amueblada y equipada con aire acondicionado central frío\/calor, camas dobles con canapé, televisores en todas las habitaciones, persianas eléctricas en la suite principal, y un sistema de riego automático y toldo en la terraza principal. Se entrega completamente amueblada y con todos los electrodomésticos necesarios. La propiedad dispone de plaza de parking en la misma finca, incluida en el precio. Este ático es la opción perfecta para quienes buscan un hogar moderno, funcional y con un toque de exclusividad en una de las mejores zonas de Barcelona. La realidad del mobiliario puede no corresponder exactamente con las fotografías mostradas en este anuncio.  Contacte con nosotros para ver más inmuebles similares. * En cumplimiento de la Ley 12\/2023 y la Llei 18\/2007 informamos que: Renta último contrato de arrendamiento: 6.000, 00 €.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":40.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Sagrada Família, Barcelona",
            "title":"Piso en calle de Sardenya"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":35,
        "propertyCode":"106304681",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/0a\/43\/92\/1278820375.webp",
        "externalReference":null,
        "numPhotos":8,
        "floor":"1",
        "price":1066.0,
        "priceInfo":{
            "price":{
                "amount":1066.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1298.0,
                    "priceDropValue":232,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":55.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"calle Rubi, 24",
        "province":"Barcelona",
        "municipality":"Abrera",
        "district":null,
        "country":"es",
        "neighborhood":null,
        "latitude":41.5193052,
        "longitude":1.9009091,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/obra-nueva\/106304681\/",
        "distance":"27172",
        "description":"Abrera Vinya III Piso en Alquiler en Carrer Rubí, 24.",
        "hasVideo":false,
        "status":"newdevelopment",
        "newDevelopment":true,
        "hasLift":true,
        "priceByArea":19.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Abrera",
            "title":"Piso en calle Rubi, 24"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":true
    },
    {
        "index":36,
        "propertyCode":"106503817",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/b0\/33\/6c\/1284818415.webp",
        "externalReference":"2424",
        "numPhotos":41,
        "floor":null,
        "price":1645.0,
        "priceInfo":{
            "price":{
                "amount":1645.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1996.0,
                    "priceDropValue":351,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":57.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"avenida de la República Argentina, 54",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Gràcia",
        "country":"es",
        "neighborhood":"Vallcarca i els Penitents",
        "latitude":41.4093654,
        "longitude":2.1469168,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/106503817\/",
        "distance":"3486",
        "description":"Se presenta en alquiler un PISO ubicada en la zona de Vallcarca, en Barcelona. Este inmueble cuenta con una superficie construida de 57 m² con dos terrazas de 12m2 y 47m2, distribuidos en dos habitaciones y dos baños, ofreciendo un espacio funcional y cómodo para el desarrollo de actividades profesionales. La propiedad se encuentra en un edificio con ascensor y dispone de una altura de techo de 2,48 metros, lo que proporciona una sensación de amplitud. Además, cuenta con aire acondicionado, garantizando un ambiente agradable durante todo el año. El estudio es exterior, lo que permite disfrutar de vistas y de luz natural, y también incluye dos terrazas, ideal para momentos de descanso o trabajo al aire libre. Este estudio se adapta a diversas necesidades, siendo una opción adecuada para profesionales que busquen un espacio práctico y bien ubicado en una de las zonas más dinámicas de la ciudad.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":29.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Vallcarca i els Penitents, Barcelona",
            "title":"Piso en avenida de la República Argentina, 54"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":37,
        "propertyCode":"106689065",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/47\/f6\/27\/1291030810.webp",
        "externalReference":"5012",
        "numPhotos":38,
        "floor":"3",
        "price":2300.0,
        "priceInfo":{
            "price":{
                "amount":2300.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2800.0,
                    "priceDropValue":500,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":70.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"avenida del Coll del Portell",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Gràcia",
        "country":"es",
        "neighborhood":"La Salut",
        "latitude":41.408952,
        "longitude":2.1530741,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106689065\/",
        "distance":"3147",
        "description":"A ESTRENAR! - ALQUILER DE TEMPORADA- EQUIPADO Y AMUEBLADO  Descubre este espléndido apartamento renovado y completamente amueblado, situado en la zona alta de Barcelona, en el emblemático barrio de Gracia. Con 70 m² de espacio cuidadosamente diseñado, esta vivienda ofrece una distribución funcional y cómoda, ideal para quienes buscan calidad y confort en un entorno privilegiado. La vivienda cuenta con dos dormitorios: uno con una cómoda cama doble y otro con una cama individual, ambos equipados con ropa de cama de algodón y almohadas dobles para un descanso reparador. Dispone también de un salón comedor acogedor con Smart TV de 60 pulgadas, cocina independiente totalmente equipada con electrodomésticos modernos y utensilios completos, y un baño que incluye sanitario, bidé, plato de ducha y artículos de aseo esenciales. Además, el apartamento está climatizado con aire acondicionado y calefacción, e incluye wifi de alta velocidad para mayor comodidad. Ubicado en el corazón de Gracia, en una tercera planta en finca sin ascensor, este apartamento goza de una localización envidiable con vistas panorámicas de Barcelona. Está a pocos minutos de lugares icónicos como el Parque Güell y la Sagrada Familia, y rodeado de una amplia oferta cultural y gastronómica que caracteriza a este barrio. Alquilar esta propiedad significa disfrutar de un estilo de vida urbano, con todas las comodidades necesarias para entrar a vivir de inmediato. Desde Walter Haus, te invitamos a conocer este exclusivo apartamento y hacerlo tu próximo hogar en Barcelona. Contáctanos para más información.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":33.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Salut, Barcelona",
            "title":"Piso en avenida del Coll del Portell"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":38,
        "propertyCode":"106142088",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/ae\/38\/16\/1273769893.webp",
        "externalReference":"finestrelles",
        "numPhotos":58,
        "floor":"bj",
        "price":2100.0,
        "priceInfo":{
            "price":{
                "amount":2100.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2575.0,
                    "priceDropValue":475,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":100.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"calle de Joan Miró",
        "province":"Barcelona",
        "municipality":"Esplugues de Llobregat",
        "district":"Finestrelles",
        "country":"es",
        "neighborhood":null,
        "latitude":41.3847787,
        "longitude":2.0964368,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106142088\/",
        "distance":"6420",
        "description":"Vivienda nueva a estrenar con acabados de alta calidad. Planta baja con terraza en el edificio Finestrelles II. Dispone de salón comedor con cocina abierta y salida a terraza privada, 2 dormitorios dobles y dos baños. Varios armarios empotrados, calefacción con gas natural y radiadores, aire acondicionado por conductos con bomba frío\/calor, suelos de parquet, carpintería exterior con doble acristalamiento térmico y acústico y un sinfín de detalles que dan gran confort a la vivienda. Dispone de 2 plazas de aparcamiento y un magnífico trastero de grandes dimensiones. El complejo de viviendas disfruta de piscina y zonas ajardinadas, sala de gimnasio, zona de estudio, zona de ocio, zona infantil y peluquería. Tiene conserje 24 horas al día. La zona de Finestrelles está excelentemente comunicada con Barcelona (a 10 min en coche) y salida al aeropuerto, y cuenta con varios colegios internacionales como el Colegio Alemán, Sant Paul's School, Highlands School, etc. ¡Pida cita para visitarlo!",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":21.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Finestrelles, Esplugues de Llobregat",
            "title":"Piso en calle de Joan Miró"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":39,
        "propertyCode":"103788055",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/6f\/80\/d0\/1259865345.webp",
        "externalReference":"PUNTA",
        "numPhotos":26,
        "floor":"2",
        "price":2435.0,
        "priceInfo":{
            "price":{
                "amount":2435.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2970.0,
                    "priceDropValue":535,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":96.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":2,
        "address":"calle de Morales",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Les Corts",
        "country":"es",
        "neighborhood":"Les Corts",
        "latitude":41.3858535,
        "longitude":2.1408976,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/103788055\/",
        "distance":"2712",
        "description":"*APARTAMENTO CON TERRAZA Y PISCINA* *COMPLETAMENTE AMUEBLADO*. *ALQUILER MENSUAL DE 1 A 11 MESES*. Espectacular piso en la calle Morales, con 2 dormitorios dobles, 1 dormitorio individual y 2 baños. La cocina está equipada con electrodomésticos y menaje de última generación. Las camas están equipadas con ropa de cama suave, ideal para un buen descanso. El piso dispone de 2 cuartos de baño equipados con ducha completa, bañera y toallas. Además, el piso está equipado con WiFi de alta velocidad y SmartTV. El piso dispone de lavadora, aire acondicionado y lavavajillas para su máximo confort.  *Este apartamento viene equipado con un sistema de aire por conductos para un confort absoluto. *Precios sujetos a la duración de la estancia y a la reserva anticipada. *Los servicios y las mascotas están sujetos a solicitud. Se informará a los clientes de cualquier cargo adicional en el contrato final. *Nuestro equipo de diseño interno selecciona de forma experta todos los muebles y la decoración de los apartamentos para garantizar el máximo nivel de calidad y comodidad. Como parte del mantenimiento constante de la casa, las mejoras de diseño y la puesta en escena fotográfica, puede haber pequeñas diferencias entre el mobiliario que se ve en las fotos y el que encontrará en el apartamento. Consulte con un agente de ventas para cualquier pregunta o duda.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":25.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Les Corts, Barcelona",
            "title":"Piso en calle de Morales"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":40,
        "propertyCode":"106507763",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/d4\/a0\/58\/1291512258.webp",
        "externalReference":"VI-000-030-680-312",
        "numPhotos":24,
        "floor":"3",
        "price":1200.0,
        "priceInfo":{
            "price":{
                "amount":1200.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":1460.0,
                    "priceDropValue":260,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":86.0,
        "exterior":true,
        "rooms":4,
        "bathrooms":1,
        "address":"independencia",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Eixample",
        "country":"es",
        "neighborhood":"La Dreta de l'Eixample",
        "latitude":41.3859762,
        "longitude":2.1700458,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106507763\/",
        "distance":"296",
        "description":"Alquiler temporal con una duración no superior a 11 meses. Vivienda amueblada. Piso en Barcelona. Dispone de una superficie de 86 m² distribuidos en 4 habitaciones, amplio salón-comedor con terraza, cocina con lavadero y 1 baño. Piso junto al hospital Sant Pau. A su alrededor cuenta con escuelas, supermercados, comercios y paradas de autobús. Fácil acceso a las paradas de metro de la L5 Sant Pau|Dos de Mayo y Camp de l'Arpa.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":14.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Dreta de l'Eixample, Barcelona",
            "title":"Piso en independencia"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":41,
        "propertyCode":"106686724",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/71\/de\/65\/1290949212.webp",
        "externalReference":"18372",
        "numPhotos":37,
        "floor":null,
        "price":2300.0,
        "priceInfo":{
            "price":{
                "amount":2300.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2800.0,
                    "priceDropValue":500,
                    "priceDropPercentage":18
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":70.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":1,
        "address":"Barrio La Salut",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Gràcia",
        "country":"es",
        "neighborhood":"La Salut",
        "latitude":41.4092614,
        "longitude":2.1501316,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106686724\/",
        "distance":"3314",
        "description":"Piso en alquiler temporal de 70m² con vistas al mar y al skyline de Barcelona, situado en el tranquilo barrio de Gràcia. La vivienda ofrece un luminoso salón-comedor con acceso directo a un balcón con vistas a la calle. La cocina, independiente está equipada con vitrocerámica, horno, frigorífico, lavavajillas, microondas y lavadora. En la zona de descanso, encontramos un dormitorio doble exterior con salida a un segundo balcón y un dormitorio individual exterior. Además, cuenta con un baño completo con ducha. Los acabados del inmueble incluyen suelos de parquet, acristalamiento Climalit en las ventanas, aire acondicionado frío\/calor por Split y calefacción de gas natural. El piso se entrega amueblado. Ubicado en Gràcia - La Salut una de las zonas más exclusivas y tranquilas de Barcelona, combinando un ambiente residencial con la esencia bohemia del distrito de Gràcia. Ofrece calles llenas de encanto, plazas animadas, comercios locales y una rica oferta cultural y gastronómica. Destaca por su proximidad al icónico Parque Güell y otros espacios emblemáticos del pintoresco barrio de Gràcia.  ZONA: Gràcia - La Salut. TRANSPORTE PÚBLICO: Metro (L3 – Lesseps), Bus y Bicing. Índice de precios estatal: no aplica. *.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":33.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Salut, Barcelona",
            "title":"Piso"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":42,
        "propertyCode":"100528845",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/5c\/89\/29\/1294206334.webp",
        "externalReference":"16563",
        "numPhotos":46,
        "floor":null,
        "price":4000.0,
        "priceInfo":{
            "price":{
                "amount":4000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":4800.0,
                    "priceDropValue":800,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":150.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":2,
        "address":"calle d'en Copons",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"El Gòtic",
        "latitude":41.3848612,
        "longitude":2.1739004,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/100528845\/",
        "distance":"49",
        "description":"Piso a estrenar en alquiler temporal, de 150m² en una finca de obra nueva con ascensor. Dispone de terraza-solárium en la zona comunitaria y plaza de garaje en la misma finca.  El inmueble se distribuye con un estilo modernista y cuenta con un amplio y luminoso salón-comedor con acceso directo a una terraza de 26m² con vistas a la calle. La cocina americana está equipada con horno, frigorífico, lavavajillas, microondas, lavadora y secadora. La propiedad cuenta con tres dormitorios, uno en suite con un baño privado y conexión a la terraza y otros dos dormitorios dobles. Todos los dormitorios son exteriores. Además, también dispone de un baño completo con ducha adicional. Los acabados del piso incluyen suelos de parquet, acristalamientos Climalit en las ventanas y aire acondicionado frío\/calor por conducto. Se alquila totalmente amueblado. Ubicado en la zona la más céntrica de la ciudad; a solo escasos minutos de Plaça Catalunya, Portal de l’Àngel y de la Catedral de Barcelona. Una zona privilegiada, llena de servicios y establecimientos, con una inmejorable conexión con el transporte público. ZONA: Ciutat Vella – El Gòtic. TRANSPORTE PÚBLICO: Metro (L1, L3 – Catalunya), FGC, Renfe, Bicing y Bus. Índice de precios estatal: no aplica. *.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":27.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Gòtic, Barcelona",
            "title":"Piso en calle d'en Copons"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":43,
        "propertyCode":"106511276",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/26\/f4\/a1\/1291326360.webp",
        "externalReference":"130402",
        "numPhotos":53,
        "floor":"1",
        "price":2500.0,
        "priceInfo":{
            "price":{
                "amount":2500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":500,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":221.0,
        "exterior":null,
        "rooms":3,
        "bathrooms":2,
        "address":"paseo de la Plaça Major, 47",
        "province":"Barcelona",
        "municipality":"Sabadell",
        "district":"Centre",
        "country":"es",
        "neighborhood":"El Centre",
        "latitude":41.5478858,
        "longitude":2.1085614,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/106511276\/",
        "distance":"18889",
        "description":"PASSEIG PLAÇA MAJOR SABADELL Patricia Rodríguez e Iad España, tienen el placer de ofrecerles este inmueble sin igual de estilo NOVECENTISTA del año 1923, reformado por el arquitecto Antoni Darder Marsà, en una ubicación privilegiada en el Passeig de la Plaça Major de Sabadell, Vallés Occidental, Barcelona. Como negocio, es ideal para NOTARÍAS, GESTORÍAS o DESPACHOS DE ABOGADOS, creando un ambiente único. La vivienda, ocupa toda la primera planta del edificio, la cual está distribuida en diferentes dependencias, con galería, y tribuna en la fachada principal, y terraza de 84m2 ubicada en la parte de atrás. Cuenta con un pequeño ascensor. La fachada es patrimonio histórico, la cual fue reformada hace 8 años, así como la entrada de edificio, la madera es melis americano y el suelo es hidráulico original. A resaltar, en el techo del comedor una preciosa glorieta nos acoge, así como las marinas en las paredes. Este inmueble, propone muchas posibilidades, tanto de vivienda como centro de negocio, pudiendo ofrecer múltiples servicios, como notarías o gestorías, en un ambiente señorial. La distribución es como sigue a continuación: La entrada nos da la bienvenida a esta impresionante vivienda:  En el ala derecha, encontraremos una sala de estar, a continuación, el pasillo, donde se ubica un gran baño con bañera de hidromasaje y plato de ducha, avanzando armarios empotrados, el ascensor, y al final una gran habitación con vistas al Passeig de la Plaça Major. Desde la entrada, avanzamos hacia el salón, con salida a una terraza de 84m2 y un pequeño aseo. A la derecha, el office, la cocina, y la zona de lavandería. Y en el ala izquierda, una amplia estancia nos da la bienvenida, anteriormente utilizada como despacho. A continuación, una habitación con una estancia, a la cual se puede dar uso de vestidor y otra habitación con generosas medidas, terminando en tribuna, con vistas al Passeig. Excelente ubicación con todo tipo de servicios y comercios destacando la parada de FFCC a 1 m. Se podría negociar el precio del alquiler, en caso de hacerle reforma. El precio se ajustaría en función del dinero invertido, durante los 2 primeros años Llámame para concertar una visita, estaré encantada de mostrarte este inmueble en el Centro de Sabadell. Patricia Rodríguez.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":11.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"El Centre, Sabadell",
            "title":"Piso en paseo de la Plaça Major, 47"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":44,
        "propertyCode":"106769042",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/e8\/dd\/4d\/1293416525.webp",
        "externalReference":"PH103326",
        "numPhotos":54,
        "floor":null,
        "price":7500.0,
        "priceInfo":{
            "price":{
                "amount":7500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":9000.0,
                    "priceDropValue":1500,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":369.0,
        "exterior":null,
        "rooms":4,
        "bathrooms":4,
        "address":"Supermaresme",
        "province":"Barcelona",
        "municipality":"Sant Vicenç de Montalt",
        "district":"Supermaresme",
        "country":"es",
        "neighborhood":null,
        "latitude":41.5776092,
        "longitude":2.4960018,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106769042\/",
        "distance":"34355",
        "description":"En alquiler: una impresionante casa de lujo construida en el año 2001, ubicada en San Vicenç de Montalt, Maresme. Esta elegante residencia de 400 metros cuadrados ofrece el máximo confort y sofisticación con cuatro habitaciones espaciosas, tres baños completos y un aseo adicional. La casa incluye una habitación de servicio, perfecta para el personal doméstico. Destacan su cuarto insonorizado, ideal para un estudio de música o cine en casa, y un amplio garaje con capacidad para cuatro coches. La propiedad está completamente amueblada y cuenta con una hermosa piscina y un cuidado jardín, cuyo mantenimiento está incluido en el alquiler. Para los amantes de la sostenibilidad, la casa dispone de paneles solares que cubren el costo de la electricidad, y también cuenta con aire acondicionado para mantener una temperatura perfecta durante todo el año. No pierdas la oportunidad de vivir en una de las mejores zonas, con todas las comodidades y el lujo que mereces. ¡Contacta para más detallesyvisitas!",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":20.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"independantHouse"
        },
        "suggestedTexts":{
            "subtitle":"Supermaresme, Sant Vicenç de Montalt",
            "title":"Casa independiente"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":true,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":45,
        "propertyCode":"106295933",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/6a\/5c\/72\/1279385724.webp",
        "externalReference":"W-02XCTS",
        "numPhotos":9,
        "floor":null,
        "price":2500.0,
        "priceInfo":{
            "price":{
                "amount":2500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":500,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":237.0,
        "exterior":null,
        "rooms":3,
        "bathrooms":3,
        "address":"calle Mare de Déu de Loreto, 12",
        "province":"Girona",
        "municipality":"Girona",
        "district":"Migdia Casernes",
        "country":"es",
        "neighborhood":null,
        "latitude":41.9717669,
        "longitude":2.822415,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/106295933\/",
        "distance":"84616",
        "description":"Esta moderna casa de diseño sostenible cuenta con tres amplias habitaciones y tres baños, ofreciendo un espacio ideal para familias o grupos.  Los baños, diseñados con acabados de alta calidad, cuentan con grifería de bajo consumo, contribuyendo a la eficiencia energética del hogar. La cocina, de concepto abierto, se presenta como un espacio funcional, ideal para personalizar según tus preferencias. El sistema de aire acondicionado garantiza un ambiente fresco y confortable durante todo el año, mientras que los grandes ventanales permiten la entrada de luz natural y ofrecen vistas al jardín. Además, la propiedad incluye un estacionamiento privado con capacidad para dos vehículos, asegurando comodidad y seguridad. Su diseño sostenible se refleja en el uso de materiales ecológicos y en un sistema de energía renovable que reduce el consumo energético. Este hogar no solo es un espacio acogedor, sino también un compromiso con el medio ambiente y la calidad de vida.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":11.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"terracedHouse"
        },
        "suggestedTexts":{
            "subtitle":"Migdia Casernes, Girona",
            "title":"Chalet adosado en calle Mare de Déu de Loreto, 12"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":46,
        "propertyCode":"40253195",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/34\/4f\/ea\/1258175487.webp",
        "externalReference":"201090",
        "numPhotos":54,
        "floor":"bj",
        "price":2900.0,
        "priceInfo":{
            "price":{
                "amount":2900.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3500.0,
                    "priceDropValue":600,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"duplex",
        "operation":"rent",
        "size":175.0,
        "exterior":true,
        "rooms":3,
        "bathrooms":3,
        "address":"Sant Joan Bosco, 45",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sarrià-Sant Gervasi",
        "country":"es",
        "neighborhood":"Sarrià",
        "latitude":41.3943624,
        "longitude":2.1274532,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/40253195\/",
        "distance":"3968",
        "description":"Se alquila por temporada demostrada. Piso-loft de 175 m2 reformado, con acabados de lujo, a estrenar en la mejor zona de Sarrià. Consta de dos zonas diferenciadas y separadas por una escalera. En una tenemos tres dormitorios (dos individuales con salida a la galería, uno de ellos con armario empotrado, y otro doble exterior con amplio vestidor incorporado) y dos baños con plato de ducha. En la otra, hay un gran espacio salón-comedor con cocina y abierta que tiene una gran isla central así como horno, placa de inducción, microondas, lavavajillas y nevera, todos los electrodomésticos de calidad; altillo de 125 m2 y un aseo de cortesía. Situada en una planta baja y dispone de acceso directo a la calle y de un pequeño espacio para dejar motocicletas y\/o bicicletas. Suelo de parqué, calefacción de gas y aire acondicionado por todo el inmueble. Parquing opcional en finca adyacente por 200 € más. Comunidad e IBI incluidos en la renta.  No admiten mascotas.  Situada en la mejor zona de Barcelona, en pleno Passeig Sant Joan Bosco de Sarrià. Rodeada de muchos restaurantes, tiendas de alto standing y servicios. Está cerca de la Plaça d'Artós y de los FGC Sarrià y de los Jardins de Vil·la Amèlia.  Comunidad e IBI incluidos en la renta. Certificado energético letra E 117 y D 23. IRPA 15,27€\/m2. CIRPA: No se encuentra en la web del ministerio.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":false,
        "priceByArea":17.0,
        "detailedType":{
            "typology":"flat",
            "subTypology":"duplex"
        },
        "suggestedTexts":{
            "subtitle":"Sarrià, Barcelona",
            "title":"Dúplex en Sant Joan Bosco, 45"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":false,
            "parkingSpacePrice":200.0
        },
        "newDevelopmentFinished":null
    },
    {
        "index":47,
        "propertyCode":"106679301",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/f6\/a8\/f2\/1290731035.webp",
        "externalReference":"W-02XLK0",
        "numPhotos":51,
        "floor":null,
        "price":5000.0,
        "priceInfo":{
            "price":{
                "amount":5000.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":6000.0,
                    "priceDropValue":1000,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"chalet",
        "operation":"rent",
        "size":216.0,
        "exterior":null,
        "rooms":4,
        "bathrooms":3,
        "address":"Vinyet-Terramar-Can Pei-Can Girona",
        "province":"Barcelona",
        "municipality":"Sitges",
        "district":"Vinyet-Terramar-Can Pei-Can Girona",
        "country":"es",
        "neighborhood":null,
        "latitude":41.2357888,
        "longitude":1.7957559,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106679301\/",
        "distance":"35643",
        "description":"Magnifica villa en la zona privilegiada de Sitges Magnífica villa en alquiler. Ideal para familias en la hermosa ciudad costera de Sitges. La villa está ubicada en una zona privilegiada, cerca de todos los servicios y a poca distancia de la playa. La vivienda cuenta con 4 dormitorios dobles, lo que permite alojar cómodamente a 8 personas. Todos los dormitorios están amueblados con camas grandes y cómodas, y cuentan con amplios armarios empotrados para el almacenamiento. Los baños son modernos y están equipados con bañera o ducha. Cocina abierta y completamente equipada con electrodomésticos de alta calidad, incluyendo nevera, horno, lavavajillas y lavadora. El salón es espacioso y luminoso, con cómodos sofás y una televisión de pantalla plana. El jardín de la villa es un oasis de tranquilidad, con una piscina privada y una zona de césped donde relajarse. También hay una zona de comedor al aire libre con una mesa y sillas, perfecta para disfrutar de comidas al aire libre durante los meses de verano. La villa se alquila desde septiembre hasta junio, pero si estás interesado en una estancia más larga, te sugerimos que consultes con la agencia o propietario para conocer disponibilidad y precios. No pierdas la oportunidad de alquilar esta magnífica villa en Sitges y disfrutar de unas vacaciones inolvidables en la costa catalana. Gran tenedor: no Precio último contrato: 6.000 Precio índex: no aplica Sitges ha sido desde siempre un lugar que ha hechizado artistas, turistas y en general visitantes de todas partes. Para muchos el secreto es su luz y los casi 300 días de sol al año. La naturaleza ha sido generosa con Sitges, ya que tiene el privilegio de estar situada en la costa del mar Mediterráneo y al pie del macizo del Garraf. A nivel cultural, el legado es extraordinario. El arte está vivo y las tradiciones se mantienen con modernidad. Sitges ha conservado importantes referencias medievales y lo pintoresco de la antigua villa de campesinos y pescadores. Goza de un carácter cosmopolita gracias a la heterogeneidad de su población, donde conviven más de 70 nacionalidades diferentes, lo cual certifica la existencia de cuatro colegios internacionales en los alrededores. Ahora, el Sitges del siglo XXI se basa en la creatividad, el talento y la innovación, pero sin perder nunca las raíces. Sitges es una ciudad que atrae y seduce.",
        "hasVideo":false,
        "status":"good",
        "newDevelopment":false,
        "hasLift":null,
        "priceByArea":23.0,
        "detailedType":{
            "typology":"chalet",
            "subTypology":"independantHouse"
        },
        "suggestedTexts":{
            "subtitle":"Vinyet-Terramar-Can Pei-Can Girona, Sitges",
            "title":"Casa independiente"
        },
        "hasPlan":false,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":{
            "hasParkingSpace":true,
            "isParkingSpaceIncludedInPrice":true
        },
        "newDevelopmentFinished":null
    },
    {
        "index":48,
        "propertyCode":"106632802",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/5c\/07\/62\/1289337418.webp",
        "externalReference":"M145",
        "numPhotos":30,
        "floor":"5",
        "price":2400.0,
        "priceInfo":{
            "price":{
                "amount":2400.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":2900.0,
                    "priceDropValue":500,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":88.0,
        "exterior":false,
        "rooms":2,
        "bathrooms":2,
        "address":"calle de Ramon Turró",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Sant Martí",
        "country":"es",
        "neighborhood":"La Vila Olímpica del Poblenou",
        "latitude":41.3910574,
        "longitude":2.1921934,
        "showAddress":false,
        "url":"https:\/\/www.idealista.com\/inmueble\/106632802\/",
        "distance":"1701",
        "description":"ONLY AVAILABLE TO BOOK FOR 32 DAYS OR LONGER Discover this exclusive luxury apartment in the heart of Barcelona, on the iconic Ramón Turró Street. Brand new and elegantly designed, it offers a modern and sophisticated atmosphere, perfect for a comfortable and memorable stay. Experience the ultimate in luxury and comfort in this stunning new apartment, located in the heart of Barcelona on the renowned Ramón Turró Street. Perfectly blending elegance and modern design, this sophisticated property offers everything you need for a memorable stay in one of the world’s most vibrant cities. The apartment features two spacious bedrooms, each thoughtfully furnished with its own bed, ensuring a relaxing and comfortable atmosphere for all guests. The two contemporary-style bathrooms are designed with attention to detail, offering sleek finishes and all the necessary amenities. Whether you're preparing for a day of sightseeing or unwinding after a busy day, these stylish spaces provide the ideal environment to recharge. One of the standout features of this apartment is its beautiful private terrace, offering a serene spot to enjoy. Whether you're sipping your morning coffee or enjoying a glass of wine in the evening, the terrace is the perfect place to relax and soak in the atmosphere of Barcelona. Located in a prime area, with the perfect combination of luxury, style, and convenience, this apartment is a true retreat for those seeking the best of Barcelona living. Whether you're in the city for business, leisure, or a combination of both, this apartment offers the ultimate in comfort and sophistication. Don’t miss the opportunity to stay in this exceptional property. IMPORTANT - The following amounts aren't included in the rental price and will be charged upon arrival into the property: UTILITY FEES (water, electricity, wifi) 200€ per month (should the bills sum up to a higher amount, the tenant will be asked to pay the difference). LATE CHECK-IN:  For check-ins from 8pm to 10pm: 40€ For check-ins from 10pm to 11pm: 60€ EARLY CHECK-IN: (before 3pm) Subject to availability and there is a 40€ early check-in fee. Please note that in case the apartment is being cleaned, the early check-in fee still applies and you can ONLY leave your luggage in the apartment. The apartment is equipped with an alarm\/surveillance system. A rental contract will be signed between the guest and the owner that highlights the booking details as well as the property and building rules. Please note that if you book for less than 32 nights, we will cancel the booking and refund the amount paid minus the payment processing fee.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":27.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"La Vila Olímpica del Poblenou, Barcelona",
            "title":"Piso en calle de Ramon Turró"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    },
    {
        "index":49,
        "propertyCode":"103724462",
        "thumbnail":"https:\/\/img4.idealista.com\/blur\/WEB_LISTING\/0\/id.pro.es.image.master\/74\/19\/77\/1198212133.webp",
        "externalReference":"ARC DE TRIUNFO",
        "numPhotos":18,
        "floor":"5",
        "price":2500.0,
        "priceInfo":{
            "price":{
                "amount":2500.0,
                "currencySuffix":"€\/mes",
                "priceDropInfo":{
                    "formerPrice":3000.0,
                    "priceDropValue":500,
                    "priceDropPercentage":17
                }
            }
        },
        "propertyType":"flat",
        "operation":"rent",
        "size":82.0,
        "exterior":true,
        "rooms":2,
        "bathrooms":2,
        "address":"SANT PERE MÉS BAIX & D'EN LLASTICS s\/n",
        "province":"Barcelona",
        "municipality":"Barcelona",
        "district":"Ciutat Vella",
        "country":"es",
        "neighborhood":"Sant Pere - Santa Caterina i la Ribera",
        "latitude":41.3886435,
        "longitude":2.1791434,
        "showAddress":true,
        "url":"https:\/\/www.idealista.com\/inmueble\/103724462\/",
        "distance":"620",
        "description":"CENTRO HISTÓRICO\/EL BORN\/BARCELONA\/ALQUILER TEMPORAL\/DESDE 14.12. 24-29.04. 25\/DISPONIBLE RESERVA ONLINE Piso en alquiler en el centro antiguo de la ciudad. Un espacio lleno de encanto con toques boho-chic. Cuenta con amplias ventanas que permiten la entrada de mucha luz natural y suelos y vigas de madera originales del techo que le dan un toque rústico. La distribución del espacio es inteligente, con áreas fluidas y funcionales. La sala de estar cuenta con mobiliario contemporáneo y rústico, con detalles cuidadosamente seleccionados para crear un ambiente de tranquilidad. La cocina, de estilo moderno-campestre, está equipada con electrodomésticos de última generación y es un lugar inspirador para la creatividad culinaria. Los dormitorios tienen un diseño moderno, con textiles de colores cálidos y divertidos. Las camas matrimoniales son suaves y cómodas, y hay amplios armarios empotrados para almacenamiento. El piso se encuentra en la quinta planta y cuenta con ascensor.",
        "hasVideo":true,
        "status":"good",
        "newDevelopment":false,
        "hasLift":true,
        "priceByArea":30.0,
        "detailedType":{
            "typology":"flat"
        },
        "suggestedTexts":{
            "subtitle":"Sant Pere - Santa Caterina i la Ribera, Barcelona",
            "title":"Piso en Sant Pere Més Baix & d'En Llastics s\/n"
        },
        "hasPlan":true,
        "has3DTour":false,
        "has360":false,
        "hasStaging":false,
        "topNewDevelopment":false,
        "topPlus":false,
        "parkingSpace":null,
        "newDevelopmentFinished":null
    }
]